const destinyRaidChallanges = {
    ron: [
        {
            hash: 766975360,
            encounter: 1,
            description: "Мучителей можно убивать только под баффом «Поле света»",
        },
        {
            hash: 138641527,
            encounter: 2,
            description: "необходимо _ перед _, а после _ необходимо _ на каждых этажах",
        },
        {
            hash: 2070303007,
            encounter: 3,
            description: "Инструкция по прохождению испытания отсутствует...",
        },
        { hash: 1616571513, encounter: 4, description: "Инструкция по прохождению испытания отсутствует..." },
    ],
    kf: [
        {
            hash: 3577304467,
            encounter: 1,
            description: "Игроки не могут получить одно из двух клейм («Клеймо разгадателя» или «Клеймо ткача») дважды подряд",
        },
        {
            hash: 2159250954,
            encounter: 2,
            description: "Игроки должны украсть марку у своего товарища по команде в течение пяти или менее секунд после получения баффа «Похититель марк»",
        },
        {
            hash: 2890753840,
            encounter: 3,
            description: "Игрок, держащий бафф «Взгляд Голгорота», должен находиться в Пруду Восстановленного Света, когда другой игрок берет Взгляд",
        },
        {
            hash: 2936050162,
            encounter: 4,
            description: "Те, кто стоит на платформе, должны оставаться на месте, пока бегун не схватит клеймо",
        },
        { hash: 4152669757, encounter: 5, description: "Вы не можете убить одного и того же Огра или Рыцаря-Пожирателя Света дважды" },
    ],
    votd: [
        { hash: 2672226122, encounter: 1, description: "Убивайте неудержимых воителей одновременно или не убивайте их совсем" },
        { hash: 3425521520, encounter: 2, description: "Выносите из комнаты со знаками не более одного за раз" },
        { hash: 2255984700, encounter: 3, description: "Рыцаря на продление таймера должен убивать всегда разный игрок" },
        { hash: 2098788044, encounter: 4, description: "Не потерять бафф «Иссушающая сила»" },
    ],
    vog: [
        { hash: 3135466059, encounter: 1, description: "Не убивайте виверн пока они не начнут сливаться со слияниями" },
        { hash: 274420331, encounter: 2, description: "Один игрок не должен разругать один и тот же оракул более одного раза" },
        { hash: 2814846409, encounter: 3, description: "Не позволяйте храмовнику телепортироваться по время фазы урона" },
        { hash: 3212721586, encounter: 4, description: "Виверна и минотавр в порталах должны быть уничтожены одновременно" },
        { hash: 1572570117, encounter: 5, description: "Каждый игрок в порталах (Марс/Венера) должен сломать по одному оракулу" },
    ],
    dsc: [
        {
            hash: 4023623132,
            encounter: 1,
            description: "Закрыть этап за три фазы, каждый игрок должен взять бафф оператора и сломать по два терминала",
        },
        {
            hash: 3361897360,
            encounter: 2,
            description: "Необходимо удерживать все копии дебаффа «Репликации Атракс» до финальной фазы урона и не сбрасывать их в космос",
        },
        {
            hash: 201968501,
            encounter: 3,
            description: "Каждый игрок должен использовать бафф. Смену баффов нужно проводить после деактивации какой-либо аугментации",
        },
        { hash: 191124900, encounter: 4, description: "Занести все четыре заряда за раз, чтобы сразу началась фаза урона по боссу" },
    ],
    gos: [
        {
            hash: 584466411,
            encounter: 1,
            description: "Не убивать циклопов, появляющихся в комнате, когда в ней находится босс-гарпия. Тех, что уже есть в каждой следующей комнате, и в конце этапа - можно",
        },
        { hash: 787678752, encounter: 2, description: "Бафф «Просветление» должен обновляться одновременно на всех участниках группы" },
        { hash: 2626004713, encounter: 3, description: "Каждый раз в шпиль должно быть внесено 10 частиц" },
        {
            hash: 4073197101,
            encounter: 4,
            description: "Каждый шпиль должен быть полностью заполнен за 10 секунд с момента вноса первых частиц",
        },
    ],
    lw: [
        { hash: 2834033523, encounter: 1, description: "Необходимо активировать все 9 платформ и убить огров в центре" },
        { hash: 217815700, encounter: 2, description: "За весь этап не получить урона от босса" },
        { hash: 3632655552, encounter: 3, description: "Нельзя убивать маленьких огриков рядом с боссом" },
        { hash: 1741733430, encounter: 4, description: "Не дать рыцарям в комнатах добраться до центра" },
        { hash: 1498263100, encounter: 5, description: "Нельзя стрелять в один и тот же глаз Ривен более одного раза" },
    ],
};
export default destinyRaidChallanges;
