const raidGuide = {
    ron: [
        {
            name: "1 этап рейда - Катаклизм",
            description: "На этом этапе нас знакомят с основной механикой рейда - механикой «Садовников»",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Распределение + Основная механика рейда",
                            description: "На первом этапе команда делится на две группы: один садовник и чистильщики противников\n\nСадовник занимается активацией узлов путем последовательного соединения их\nНачать цепочку можно постреляв по полю семени",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086696899375009812/RoN.png",
                        },
                        {
                            name: "Получение бафа",
                            description: "После этого Вы получите баф «Поле Света» (или «Поток Тьмы» при стрельбе по полю Тьмы на следующих этапах)\nСледите за лучом света (или тьмы), который исходит из поля",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086697464888832020/RoN.png",
                        },
                        {
                            name: "Активация узла",
                            description: "Далее Вы подходите к узлу на близкое расстояние, в сторону которого был направлен луч света, и стреляете по нему\nДля активации достаточно попасть одной пулей\n\nУзлы также можно активировать ударом ближнего боя по полу",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086700268202234016/RoN.png",
                        },
                        {
                            name: "Повторение",
                            description: "После активации узла повторяем получение бафа и активацию узлов до завершения цепочки на текущей стороне, а затем меняем сторону. Повторяем 4 раза (всего 4 стороны)",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086702165625675938/RoN.png",
                        },
                        {
                            name: "Задачи остальных участников",
                            description: "Пока садовник занимается узлами, остальные игроки должны продлевать время этапа\nВремя можно продлить убив мучителя, который появляется после убийства 2 псионов в куполах\nКаждый убитый мучитель продлевает время этапа на 30 секунд",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086709312681939055/RoN.png",
                        },
                        {
                            name: "Важное уточнение для этого и следуюших этапов",
                            description: "Если садовник получил баф «Поле Света» или «Поток Тьмы», а потом (не активируя следующего узла и не дожидаясь завершения 20 секундного таймера на бафе) взял баф повторно, то произойдет дестабилизация узлов на стороне\nПри дестабилизации все узлы на стороне пропадают на 15 секунд, а после заново появляются на тех же местах",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 1 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1086684007116312696/Tl1w4rK.png",
                },
            ],
        },
        {
            name: "2 этап рейда - Деление",
            description: "Ничего нового. Такая же механика с садовником света, а также садовником тьмы",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Распределение",
                            description: "На втором этапе команда делится на 2 группы по 3 человека - команда света и команда тьмы\nОдин человек в каждой команде заранее назначается садовником",
                        },
                        {
                            name: "Садовники",
                            description: 'Садовники занимаются узлами как на первом этапе. На этом этапе для активации узлов придется пользоваться "лифтами" для перемещения с одной стороны карты на другую. Узлы появляются в следующей последовательности: 1, 3 и 5-е на противоположной от вашего бафа стороне, 2 и 4 на вашей стороне',
                        },
                        {
                            name: "Зачищающие",
                            description: 'В то время как садовники будут активировать узлы, задача зачищающих - зачищать всё живое на их стороне\nПосле активации первого узла начнут появляться противники в "белом" щите на стороне света и "темном" щите на стороне тьмы. Для убийства таких противников необходимо получить баф света/тьмы, встав в поле семени и дождавшись садовника из вашей команды. Зачистка таких противников необязательна до завершения цепочки узлов на этаже, так что можно игнорировать подобных противников до момента завершения активации всех узлов',
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086713663009861632/RoN.png",
                        },
                        {
                            name: "Повторение",
                            description: "После того, как садовник вашей стороны сказал о завершении активации всех узлов (или после того, как Вы заметили столбы света цвета вашей стороны на карте, или когда пропал дебаф «Неминуемый выброс»), Вы можете самостоятельно активировать поле узла для получения бафа\nЗачищаете всех оставшихся противников и идите к последнему (самому дальнему) лифту, с его помощью поднимайтесь на следующий этаж\nНа следующем этаже все задачи повторяются для зачищающих и садовников\nТаким образом необходимо зачистить 3 этажа",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 2 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1086684007795806228/P1dxxLy.png",
                },
            ],
        },
        {
            name: "3 этап рейда - Макрокосм",
            description: "Этот этап никак не связан с механиками остального рейда\nНа этапе мы занимаемся перемещением планет",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Распределение",
                            description: "Команда распределяется на 2 группы по 3 человека: одна группа на левой стороне, другая - на правой\nВ этих группах у каждого есть по одной роли: бегун на верхнем этаже, бегун на нижнем этаже и зачищающий противников\nБегуны на нижних этажах должны находиться неподалеку от планет обозначенных от 1 до 3, а на верхних - от 4 до 6",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086684008781455400/nIhkjxF.png",
                        },
                        {
                            name: "Начало этапа",
                            description: "После начала этапа все игроки должны сконцентрироваться на зачистке противников в центре карты\nЧерез несколько секунд после начала этапа появятся два центуриона в огненном щите\nУбийство ближайшего к одной из сторон центуриона приведет к появлению «Лейтенанта» (колосса), чье убийство даст баф «Планетарное зрение», что позволяет видеть цвета планет той стороны, на которой был убит Лейтенант",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1087147131736961157/RoN.png",
                        },
                        {
                            name: "Планетарное зрение",
                            description: "Если Вы получили баф на левой стороне, то все левые планеты для Вас будут светиться белым цветом, кроме двух\nТо же самое касается и правой стороны: все планеты будут «в темноте», за исключением двух\nИспользуя карту, необходимо как можно быстрее сообщить, какие две планеты светятся не тем цветом",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086684008781455400/nIhkjxF.png",
                        },
                        {
                            name: "Перемещение планет",
                            description: 'После названия 4-х неверных планет (2 слева, 2 справа) верхние бегуны "берут" их верхние неверные планеты (под всеми планетами будет сфера), а нижние бегуны берут их нижние. Далее они бегут на противоположную сторону (пример: верхний правый бегун на верхнюю левую сторону) и "заменяет" неверную планету там\nПример: если слева неверные планеты 1 и 4 (называется л14), а справа 2 и 6 (п26), то верхний правый бегут берет планету на его стороне под номером 6 и перемещает её под планету 4 слева\nДля корректной замены необходимо чтобы оба бегуна (пример: верхний левый и верхний правый) заменили свои планеты\n\nПосле успешной замены планет на обоих этажах в чате событий (слева снизу) будет надпись "Индексация планет произошла"',
                        },
                        {
                            name: "Начало фазы урона по боссу",
                            description: "После надписи «Индексация планет» необходимо опять убить всех противников (в том числе и центурионов, и Лейтенантов), но в этот раз после получения «Планетарного зрения» будут видны центральные планеты\nНеобходимо назвать какие планеты светятся каким цветом (всегда 2 света и 1 тьма или наоборот)\nПосле названия цвета планет бегунам необходимо принести любую планету с их стороны под планету соответствующего цвета в центре (свет к свету, тьма к тьме)\nПосле того как все 3 планеты будут принесены, начинается фаза урона. Босс будет в щите света или тьмы, поэтому необходимо встать на соответствующий баф на кнопке под планетой нужного цвета (если 2 света, то босс начнет светиться светом → тьмой → светом и наоборот если 2 тьмы)\nФаза урона похожа на 2 этап рейда КП - у босса есть небольшая светящаяся полоска здоровья, снеся которую у Вас будет несколько дополнительных секунд на доп. урон, но после будет необходимо идти под следующую кнопку",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1087153805617008751/RoN.png",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 3 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1086684008781455400/nIhkjxF.png",
                },
            ],
        },
        {
            name: "4 этап рейда - Незарек",
            description: "Финальный этап рейда. Такая же механика с двуями садовниками, но ещё надо босса избивать",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Распределение",
                            description: "Команда распределяется на 2 группы по 3 человека: одна группа на левой стороне, другая - на правой\nВ этих группах у каждого есть по одной роли: садовник, танк и зачищающий",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1086683256830828624/WrpWBxZ.png",
                        },
                        {
                            name: "Садовники",
                            description: 'Задача садовников остается практически неизменной - они точно также должны заниматься узлами на их сторонах, но в добавок, они должны активировать "островки безопасности", которые помогут пережить вайп-механику\n\nКогда один из танков отстрелит плечо босса, из босса будет всплеск светлой или темной энергии, а на самом боссе временно появятся узоры того же цвета - если энергия светлая, то садовник на темной стороне должен взять баф «Поток Тьмы» и идти на любой, уже завершенный, узел света (и наоборот если будет всплеск темной энергии), а после пострелять по узлу - на точке появляется "убежище" и все союзники, которые встанут на точку, получат 15-секундный баф, который спасет их от вайп-механики\nЗаниматься активацией убежища стоит со 2 фазы урона по боссу - на 1 дается достаточно времени до вайпа',
                        },
                        {
                            name: "Танки",
                            description: "Танки на этом этапе занимаются удерживанием «Ненависти Незарека»\n\nКак только босс начнет подбрасывать всю команду, танки должны стрелять в грудь босса для получения этого дебафа\nПосле получения дебафа необходимо сломать плечи боссу для того, чтобы из босса произошел всплеск энергии, чтобы садовники знали на какой стороне необходимо активировать убежище\nКак заканчивается дебаф - необходимо повторно стрелять в грудь боссу для его получения\nТанкам необходимо заниматься этим дебафом до завершения построения узлов обоими садовниками",
                        },
                        {
                            name: "Зачищающие",
                            description: "Зачищающие должны как можно эффективнее убивать всех противников, которые могут помешать садовникам активировать узлы",
                        },
                        {
                            name: "Начало фазы урона по боссу",
                            description: "После завершения построения узлов обоими садовниками начинается фаза урона по боссу\n\nВ это время необходимо собраться всей командой в каком-либо заранее обговоренном месте и наносить урон по Незареку до завершения фазы\nВо время фазы босс будет телепортироваться в сторону игроков, а также использовать различные касты - лучше стоять на какой-либо возвышенности\nЕсли основная часть здоровья босса была снесена, то начинается финальная фаза - необходимо добить босса за короткий промежуток времени",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 4 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1086684010937327830/Q0o5sWn.png",
                },
                {
                    label: "Босс во время этапа",
                    style: "Secondary",
                    name: "Внешний вид босса при разных условиях",
                    description: "Во время этапа босс будет принимать различные облики:\n - Immune: облик на начало этапа\n - DPS: облик во время нанесения урона по боссу\n - Wipe Casting: облик во время вайпа\n - Light/Dark attunement: облик при всплеске света/тьмы",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1087539084756529222/tobias-kwan-tk-nezarec-05.jpg",
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: "Secondary",
                    name: "Награды за этапы рейда",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1086682163103146156/Root-of-Nightmares-official-loot-table-Destiny-2.png",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: "Secondary",
                    name: "Рекомендуемое снаряжение для рейда Источник кошмаров",
                    description: "> **1 и 2 этапы**\n - Любое оружие на зачистку толп противников\n\n> **3 и 4 этапы**\n - Обязателен 1 (не больше) [Гьяллархорн](https://www.light.gg/db/ru/items/1363886209/%D0%B3%D1%8C%D1%8F%D0%BB%D0%BB%D0%B0%D1%80%D1%85%D0%BE%D1%80%D0%BD) на команду\n - Любые легендарные ракетницы ([Забияка](https://www.light.gg/db/ru/items/4255171531/%D0%B7%D0%B0%D0%B1%D0%B8%D1%8F%D0%BA%D0%B0/), [Пальмира-Б](https://www.light.gg/db/ru/items/3489657138/%D0%BF%D0%B0%D0%BB%D1%8C%D0%BC%D0%B8%D1%80%D0%B0-%D0%B1/), до 1 на команду [Грохот в ночи](https://www.light.gg/db/ru/items/1959650777/%D0%B3%D1%80%D0%BE%D1%85%D0%BE%D1%82-%D0%B2-%D0%BD%D0%BE%D1%87%D0%B8/) с [Леденящее попадание](https://www.light.gg/db/ru/items/2978966579/%D0%BB%D0%B5%D0%B4%D0%B5%D0%BD%D1%8F%D1%89%D0%B5%D0%B5-%D0%BF%D0%BE%D0%BF%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5/))\n - [Бремя идзанаги](https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/) / до 1 на команду [Горстка пепла](https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот",
                },
            ],
        },
    ],
    kf: [
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: "Secondary",
                    name: "Награды за этапы рейда",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098392978512420965/kingsfall.jpg",
                },
                {
                    label: "Руны на секретный сундук",
                    style: "Secondary",
                    name: "Карта рун на секретный сундук",
                    description: "Необходимо узнать какие символы будут активны под порталом после активации 6 статуй на входе\nЭти 3 символа активируются в течение рейда\nЕсли активировать не все или активировать и не деактивировать неверный, то сундук не появится\nПосле активации всех нужных рук прозвучит оповещение и появится соответствующая надпись",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098648030795796551/secret-chest-2048x0.jpg",
                },
                {
                    label: "Карта лабиринта",
                    style: "Secondary",
                    name: "Карта лабиринта после второго этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1102618292063056012/I6EiFg6.jpeg",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: "Secondary",
                    name: "Рекомендуемое снаряжение для рейда Гибель Короля",
                    description: "> **1 этап**\n - Любое оружие на зачистку толп противников\n\n> **2, 4, 5-ые этапы**\n - Обязателен 1 (не больше) [Гьяллархорн](https://www.light.gg/db/ru/items/1363886209/%D0%B3%D1%8C%D1%8F%D0%BB%D0%BB%D0%B0%D1%80%D1%85%D0%BE%D1%80%D0%BD) на команду\n - Любые легендарные ракетницы ([Забияка](https://www.light.gg/db/ru/items/4255171531/%D0%B7%D0%B0%D0%B1%D0%B8%D1%8F%D0%BA%D0%B0/), [Пальмира-Б](https://www.light.gg/db/ru/items/3489657138/%D0%BF%D0%B0%D0%BB%D1%8C%D0%BC%D0%B8%D1%80%D0%B0-%D0%B1/), до 1 на команду [Грохот в ночи](https://www.light.gg/db/ru/items/1959650777/%D0%B3%D1%80%D0%BE%D1%85%D0%BE%D1%82-%D0%B2-%D0%BD%D0%BE%D1%87%D0%B8/) с [Леденящее попадание](https://www.light.gg/db/ru/items/2978966579/%D0%BB%D0%B5%D0%B4%D0%B5%D0%BD%D1%8F%D1%89%D0%B5%D0%B5-%D0%BF%D0%BE%D0%BF%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5/))\n - [Бремя идзанаги](https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/) / до 1 на команду [Горстка пепла](https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот\n\n> **3 этап**\n - Для людей, которые занимаются бафом: [Буксировочная пушка](https://www.light.gg/db/ru/items/3580904581/%D0%B1%D1%83%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%BE%D1%87%D0%BD%D0%B0%D1%8F-%D0%BF%D1%83%D1%88%D0%BA%D0%B0), любые снайперские винтовки\n - Любые хорошие линейно-плазменные винтовки ([Катаклизм](https://www.light.gg/db/ru/items/999767358/%D0%BA%D0%B0%D1%82%D0%B0%D0%BA%D0%BB%D0%B8%D0%B7%D0%BC/), [Тайпан-4fr](https://www.light.gg/db/ru/items/1911060537/%D1%82%D0%B0%D0%B9%D0%BF%D0%B0%D0%BD-4fr/)) \n - [Бремя идзанаги](https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/) / до 1 на команду [Горстка пепла](https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот",
                },
            ],
        },
    ],
    vog: [
        {
            name: "Вход рейда - Руины пробуждения — Поднять шпиль",
            description: "Вход в рейд «Хрустальный чертог»",
            buttons: [
                {
                    label: "Подробное объяснение задачи",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Открытие прохода",
                            description: "Команда делится на 3 пары\n\nПлатформ несколько, а именно 3: левая, центральная и правая\nКаждая пара игроков занимает свою синхроплатформу и активирует ее\nВо время обороны платформы от минотавров вексов, которые сбрасывают активацию платформы, на ней необязательно стоять всё время\nПосле полного формирования шпиля, появится надпись - «Шпиль активизировался»",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433218248069182/ii__walking_ruins_by_a_phantom_moon_deg8abn.jpg",
                        },
                    ],
                },
            ],
        },
        {
            name: "1 этап рейда - Колодец Храмовника",
            description: "Защитите три слияния от волн вексов, препятствуя их интеграции. На этом этапе босс ещё неуязвим",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Основная задача",
                            description: "Игроки распределяются на 3 пары и обороняют слияния вексов от 3 волн противников\nВ слияние может интегрироваться не более 4 вексов или 1 виверна\nВ течение этапа появляются <:overload:1090473013398491236>перегруженные минотавры",
                        },
                        {
                            name: "Первая фаза - одно слияние",
                            description: "Слияние (как и виверны) появляется только в центре",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433218520678490/iii_i_templar_s_well_conflux_1_by_a_phantom_moon_deg8abt.jpg",
                        },
                        {
                            name: "Вторая фаза - два слияния (левое и правое)",
                            description: "Слияние в центре пропадает (вместе с всеми вивернами), а после этого появляются слияния на левой и правой сторонах",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433218835263528/iii_ii_templar_s_well_conflux_2_by_a_phantom_moon_deg8aby.jpg",
                        },
                        {
                            name: "Третья фаза - три слияния (левое, центральное и правое)",
                            description: "Боковые слияния пропадают. Через некоторое время появляются все три слияния - левое, центральное и правое\nПосле обороны всех слияний они пропадают, и этап завершается",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433219116269588/iii_iii_templar_s_well_conflux_3_by_a_phantom_moon_deg8ac1.jpg",
                        },
                        {
                            name: "Дебаф «Метка устранения»",
                            description: 'После убийства взрывающихся вексов под ними появляется "лужа", встав в которую Вы получите дебаф, который убьет Вас когда босс произведет «Ритуал устранения»\nЗа несколько секунд перед этим появится надпись «Храмовник готовится к ритуалу устранения»\nДля сброса этого дебафа необходимо встать в колодец света в центре карты\n\nПосле того, как кто-то зайдет в колодец он пропадает на некоторое время, а поэтому предупредите команду перед этим',
                        },
                    ],
                },
            ],
        },
        {
            name: "2 этап рейда - Колодец Храмовника - Оракулы",
            description: "Необходимо уничтожать оракулы в нужном порядке на протяжении 5 волн",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Задача этапа",
                            description: "Необходимо уничтожать появляющиеся оракулы в правильной последовательности на протяжении 5 волн\nОракулы появляются в разных местах: 3 слева, 3 справа и 1 по центру",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433219586043935/iii_iv_templar_s_well_oracles_by_a_phantom_moon_deg8aef.jpg",
                        },
                        {
                            name: "Появление оракулов",
                            description: "При появлении надписи «Оракулы готовятся спеть припев» (слева снизу, над суперспособностью), **запомните последовательность** появления оракулов\nЭта последовательность повторится дважды",
                        },
                        {
                            name: "Уничтожение оракулов",
                            description: "При появлении надписи «Храмовник призывает оракулов», уничтожьте оракулы в той последовательности, в которой они появились\nЕсли сделано верно, появится надпись «Оракулы узнают припев»",
                        },
                        {
                            name: "Ошибки и очистка",
                            description: "Если оракулы уничтожены в неправильной последовательности, то игроки получат дебаф «Метка устранения»\nЕсли не сбросить дебаф, то Храмовник убьет всех игроков под ним через некоторое время\nДля его сброса необходимо встать всей команде в колодец света в центре карты (как на предыдущем этапе)\n\nКолодец света может появиться всего 3 раза - можно допустить не более 3 ошибок за этап\nПосле ошибки оракулы появятся в той же последовательности, что и были",
                        },
                        {
                            name: "Повторение",
                            description: "Уничтожайте оракулы в той последовательности, в которой они появились в течение 5 волн\nС каждой последующей волной будет добавляться дополнительный оракул (макс. - 7), после финальной волны этап будет пройден",
                        },
                    ],
                },
            ],
        },
        {
            name: "3 этап рейда - Колодец Храмовника - убийство Храмовника",
            description: "Используйте Эгиду для разрушения щита Храмовника, предотвращайте его телепортации, уничтожьте оракулы и убейте босса",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Эгида",
                            description: "Один игрок должен взять Эгиду в центре карты (ранее там был колодец света)\nЭгида используется для разрушения щита Храмовника с помощью её суперспособности, у неё также есть обычные атаки и купол, который появляется при блокировке",
                        },
                        {
                            name: "Задача игрока с Эгидой",
                            description: "Разрушьте щит Храмовника суперспособностью Эгиды, а затем предотвращайте телепортацию босса, стоя на месте телепорта",
                        },
                        {
                            name: "Задача остальных игроков",
                            description: "Дождитесь получения дебафа после разрушения оракулов боссом, а после все одновременно войдите в колодец света (**не входите в него до получения дебафа!**)\nКолодец может появиться всего 3 раза\nЗатем игрок с Эгидой разрушает щит Храмовника с помощью суперспособности, а все остальные наносят урон по боссу в это время",
                        },
                        {
                            name: "Повторение",
                            description: "Если босс телепортировался, то уничтожьте оракулы (или опять сбросьте дебаф в колодце света), дождитесь пока игрок с Эгидой не восстановит суперспособность и повторите фазу урона",
                        },
                        {
                            name: "Дебаф «Плен»",
                            description: "Один случайный игрок получит дебаф «Плен» после разрушения щита Храмовника\nЕсли в течение 15 секунд плененного игрока не освободят, то он умрет\nВнутри купола Вы не сможете стрелять, использовать способности и Ваше движение будет замедлено\nДругой участник вашей команды должен освободить Вас, разрушив купол",
                        },
                    ],
                },
                {
                    label: "Карта лабиринта",
                    style: "Secondary",
                    name: "Карта лабиринта после этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433219858681946/iv__gorgon_s_labyrinth_by_a_phantom_moon_deg8aej.jpg",
                },
            ],
        },
        {
            name: "4 этап рейда - Хрустальный чертог - Пробудить Хрустальный престол",
            description: "Проявите три слияния вексов, используя порталы и передавая друг другу Эгиду",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Подготовка",
                            description: "Поделитесь на две группы по три человека, каждая группа отвечает за свой портал и слияние вексов внутри",
                        },
                        {
                            name: "Активация порталов",
                            description: "Активируйте порталы, встав на платформы и захватив их, а после защищайте их от <:overload:1090473013398491236>перегруженных минотавров вексов",
                        },
                        {
                            name: "Оборона слияний вексов",
                            description: "По одному игроку из каждой группы входят в порталы и защищают слияние вексов внутри\nЕсли в слияние интегрируется одна виверна/минотавр или три векса - все игроки умрут",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102445323739205722/v_i_gatekeeper___portal_jumping_by_a_phantom_moon_dekehe4.jpg",
                        },
                        {
                            name: "Использование Эгиды",
                            description: "Когда в одном из порталов появляется минотавр с неуязвимым щитом, игрок в этом портале предупреждает своего союзника по стороне об этом\nСоюзник, услышав об этом, берет Эгиду в центре карты и идет в свой портал\nТам он убивает минотавра с помощью Эгиды и передает её союзнику в портале (нужно сменить оружие - Эгида выпадет из рук)",
                        },
                        {
                            name: "Передача Эгиды",
                            description: "После передачи Эгиды другой союзник подбирает его\nЗатем он выходит из портала с ней и передает её другому игроку из другой команды и ждет когда игрок из другой команды принесет ему Эгиду обратно\nИгрок, которому принесли Эгиду, подбирает её и повторяет процесс убийства минотавра и передачи Эгиды",
                        },
                        {
                            name: "Оборона центрального слияния",
                            description: "Когда появляется центральное слияние, все игроки выходят из порталов и собираются в центре карты защищая его до конца этапа, используя Эгиду для уничтожения минотавров с неуязвимыми щитами\nВсего надо убить троих минотавров (первый появляется в конце локации, второй - справа, третий - слева) и троих виверн после них",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102445324469026918/v_ii_gatekeeper_portals_middle_conflux_by_a_phantom_moon_dekejnj.jpg",
                        },
                    ],
                },
            ],
        },
        {
            name: "5 этап рейда - Хрустальный чертог - Уничтожить Атеона",
            description: "Сразитесь с Атеоном, уничтожив оракулы в порталах в нужной последовательности",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: "Primary",
                    embeds: [
                        {
                            name: "Начало этапа и портал",
                            description: "Через 80 секунд после начала этапа Атеон телепортирует трех случайных игроков в один из порталов\nТелепортированные игроки говорят остальной команде в каком они портале (если локация красная - Марс, левый портал, а если зеленая - Венера, правый)\nОдин из не телепортированных игроков открывает названый портал, а после открытия портала уходит помогать остальной команде называть оракулы и зачищать противников",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102455751626203196/vi_ii_the_glass_throne_oracles_portals_numbers_by_a_phantom_moon_dekejoq.jpg",
                        },
                        {
                            name: "Оракулы",
                            description: "Оставшиеся игроки сообщают телепортированным игрокам последовательность появления оракулов (прим.: 135), а телепортированные игроки уничтожает оракулы в названом порядке (прим.: сначала 1, потом 3, 5)",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1102455751198375997/vi_i_the_glass_throne_atheon_oracle_reading_by_a_phantom_moon_dekehxe.jpg",
                        },
                        {
                            name: "Дебаф «Метка пустоты»",
                            description: "После телепортации, на игроков в портале будет постоянно накапливаться дебаф «Метка пустоты», который будет затемнять экран\nДля его сброса одному из игроков необходимо взять Эгиду в месте, где оказываются игроки после телепортации и зажать (на секунду-2) кнопку блока как на мече (по умолч. `C`)\nСбрасывайте дебаф по просьбам союзников или где-то раз в 5-10 секунд",
                        },
                        {
                            name: "Фаза нанесения урона, ч.1",
                            description: "Игроки вне порталов называют суммарно 9 точек появления оракулов - по 3 оракула за группу\n\nПримерно на 7-8 оракуле игроки собираются на лестнице в сторону босса у портала, из которого должны выйти телепортированные игроки\nСразу после уничтожения 9 оракула всем игрокам дается баф «Месть времени», который значительно ускоряет восстановление суперспособностей, а также позволяет наносить урон по боссу - после получения бафа сразу стоит наносить урон по боссу!",
                        },
                        {
                            name: "Фаза нанесения урона, ч.2",
                            description: "После уничтожения 9 оракула всем игрокам в портале необходимо как можно быстрее переместиться к остальным игрокам через портал, который они ранее открыли (не забудьте забрать с собой Эгиду! Если Эгида будет лежать на земле более 10 секунд, то она убьет всю команду)\n\nЧерез 15 секунд после начала фазы урона (на бафе «Месть времени» будет 15 секунд) на случайного игрока наложится дебаф «Грядущее задержание»\nИгрок с дебафом «Грядущее задержание» должен отойти от группы (на метров 10-25) и предупредить их об этом\nОстальные игроки должны разрушить его клетку (обычно это делает игрок с Эгидой)",
                        },
                        {
                            name: "Повторение",
                            description: "Если Атеон не был убит в течение фазы, то весь цикл повторяется без каких-либо изменений",
                        },
                    ],
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: "Secondary",
                    name: "Награды за этапы рейда",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1101228003985477794/image0-1.png",
                },
                {
                    label: "Полная карта рейда",
                    style: "Secondary",
                    name: "Карта рейда",
                    description: "Откройте карту в полном размере с помощью кнопки снизу в изображении",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1102433217765703741/i__master_map_by_a_phantom_moon_deg8abh.jpg",
                },
            ],
        },
    ],
    dsc: [
        {
            name: "1 этап рейда - Система охраны",
            description: "Этап знакомства с бафами рейда",
            buttons: [
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 1 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098431843264643092/dr81cDh.png",
                },
            ],
        },
        {
            name: "2 этап рейда - Атракс-1",
            description: "Первый босс рейда",
            buttons: [
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 2 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098431843784724521/vu1z6vt.png",
                },
            ],
        },
        {
            name: "3 этап рейда - Ядерный спуск",
            description: "Долгий, но простой этап с зачисткой противников и внесением ядер",
            buttons: [
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 3 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098431844292243466/Gty0cyl.png",
                },
            ],
        },
        {
            name: "4 этап рейда - Таникс-Исчадие",
            description: "Финальный босс рейда",
            buttons: [
                {
                    label: "Карта этапа",
                    style: "Primary",
                    name: "Карта 4 этапа",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098431844820729896/IU1aPwx.png",
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: "Secondary",
                    name: "Награды за этапы рейда",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1098389680019492864/BlueberriesGG-Deep-Stone-Crypt-loot-table-infographic.jpg",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: "Secondary",
                    name: "Рекомендуемое снаряжение для рейда Склеп Глубокого камня",
                    description: "> **1 этап**\n - [Ксенофаг](https://www.light.gg/db/ru/items/1395261499/%D0%BA%D1%81%D0%B5%D0%BD%D0%BE%D1%84%D0%B0%D0%B3/), [Бастион](https://www.light.gg/db/ru/items/2415517654/%D0%B1%D0%B0%D1%81%D1%82%D0%B8%D0%BE%D0%BD/), [Тысяча голосов](https://www.light.gg/db/ru/items/2069224589/%D1%82%D1%8B%D1%81%D1%8F%D1%87%D0%B0-%D0%B3%D0%BE%D0%BB%D0%BE%D1%81%D0%BE%D0%B2/), [Уордклиффская катушка](https://www.light.gg/db/ru/items/1508896098/%D1%83%D0%BE%D1%80%D0%B4%D0%BA%D0%BB%D0%B8%D1%84%D1%84%D1%81%D0%BA%D0%B0%D1%8F-%D0%BA%D0%B0%D1%82%D1%83%D1%88%D0%BA%D0%B0/), легендарные ракетницы, плазменные винтовки и другое оружие, которое наносит большой урон не по криту (т.е. через желтые цифры)\n\n> **2 этап**\n - [Паразит](https://www.light.gg/db/ru/items/2812324400/%D0%BF%D0%B0%D1%80%D0%B0%D0%B7%D0%B8%D1%82/), [Плач](https://www.light.gg/db/ru/items/3487253372/%D0%BF%D0%BB%D0%B0%D1%87/), хороший легендарный меч\n\n> **3 этап**\n - Любое оружие на зачистку толп противников\n\n> **4 этап**\n - Обязателен 1 (не больше) [Гьяллархорн](https://www.light.gg/db/ru/items/1363886209/%D0%B3%D1%8C%D1%8F%D0%BB%D0%BB%D0%B0%D1%80%D1%85%D0%BE%D1%80%D0%BD) на команду\n - Любые легендарные ракетницы ([Забияка](https://www.light.gg/db/ru/items/4255171531/%D0%B7%D0%B0%D0%B1%D0%B8%D1%8F%D0%BA%D0%B0/), [Пальмира-Б](https://www.light.gg/db/ru/items/3489657138/%D0%BF%D0%B0%D0%BB%D1%8C%D0%BC%D0%B8%D1%80%D0%B0-%D0%B1/), до 1 на команду [Грохот в ночи](https://www.light.gg/db/ru/items/1959650777/%D0%B3%D1%80%D0%BE%D1%85%D0%BE%D1%82-%D0%B2-%D0%BD%D0%BE%D1%87%D0%B8/) с [Леденящее попадание](https://www.light.gg/db/ru/items/2978966579/%D0%BB%D0%B5%D0%B4%D0%B5%D0%BD%D1%8F%D1%89%D0%B5%D0%B5-%D0%BF%D0%BE%D0%BF%D0%B0%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5/))\n - [Бремя идзанаги](https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/) / до 1 на команду [Горстка пепла](https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот",
                },
            ],
        },
    ],
};
export default raidGuide;
