import { ButtonStyle } from "discord.js";
const emojis = {
    operator: "<:operator:1121300682826338304>",
    scanner: "<:scanner:1121300684852166787>",
    suppressor: "<:suppressor:1121300679479283752>",
    overload: "<:overload:1090473013398491236>",
};
const weaponLightGGLinks = {
    tractor: "https://www.light.gg/db/ru/items/3580904581/%D0%B1%D1%83%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%BE%D1%87%D0%BD%D0%B0%D1%8F-%D0%BF%D1%83%D1%88%D0%BA%D0%B0/",
    witherhoard: "https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/",
    izanagi: "https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/",
    hothead: "https://www.light.gg/db/ru/items/4255171531/%D0%B7%D0%B0%D0%B1%D0%B8%D1%8F%D0%BA%D0%B0/",
    palmira: "https://www.light.gg/db/ru/items/3489657138/%D0%BF%D0%B0%D0%BB%D1%8C%D0%BC%D0%B8%D1%80%D0%B0-%D0%B1/",
    gjallarhorn: "https://www.light.gg/db/ru/items/1363886209/%D0%B3%D1%8C%D1%8F%D0%BB%D0%BB%D0%B0%D1%80%D1%85%D0%BE%D1%80%D0%BD/",
    coldcomfort: "https://www.light.gg/db/ru/items/839786290/%D1%85%D0%BE%D0%BB%D0%BE%D0%B4%D0%BD%D1%8B%D0%B9-%D0%BF%D1%80%D0%B8%D0%B5%D0%BC/",
    lament: "https://www.light.gg/db/ru/items/3487253372/%D0%BF%D0%BB%D0%B0%D1%87/",
    thunderlord: "https://www.light.gg/db/ru/items/3325463374/%D0%B2%D0%BB%D0%B0%D0%B4%D1%8B%D0%BA%D0%B0-%D0%B3%D1%80%D0%BE%D0%BC%D0%B0/",
    guillotine: "https://www.light.gg/db/ru/items/614426548/%D0%BB%D0%B5%D0%B7%D0%B2%D0%B8%D0%B5-%D0%B3%D0%B8%D0%BB%D1%8C%D0%BE%D1%82%D0%B8%D0%BD%D1%8B/",
    leviBreath: "https://www.light.gg/db/ru/items/2591746970/%D0%B4%D1%8B%D1%85%D0%B0%D0%BD%D0%B8%D0%B5-%D0%BB%D0%B5%D0%B2%D0%B8%D0%B0%D1%84%D0%B0%D0%BD%D0%B0/",
    divinity: "https://www.light.gg/db/ru/items/4103414242/%D0%B1%D0%BE%D0%B6%D0%B5%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D1%8C/",
    xenophage: "https://www.light.gg/db/ru/items/1395261499/%D0%BA%D1%81%D0%B5%D0%BD%D0%BE%D1%84%D0%B0%D0%B3/",
};
const raidGuide = {
    ce: [
        {
            name: "1 этап рейда - Бездна",
            description: 'Игроки будут прокладывать путь через лабиринт, окутанный темнотой. В темноте на вас постепенно накладывается дебафф "Тяжесть Тьмы", который увеличивается до десяти уровней, замедляя движение и лишая возможности бегать и прыгать. Чтобы сбросить дебафф, нужно подойти к лампам, указывающим путь из лабиринта',
            buttons: [
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 1 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184182028615761/CE-Abyss.webp",
                },
            ],
        },
        {
            name: "2 этап рейда - Трон Сверхдуши",
            description: "Игрокам предстоит пересечь пропасть и уничтожить особых врагов – Хранителей Врат. Цель этой этапа - переправить всех игроков через мост, убить пять Хранителей, сохранить реликвии мечей, а затем уничтожить еще пять Хранителей Врат",
            buttons: [
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 2 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184182372532244/CE-Bridge.webp",
                },
            ],
        },
        {
            name: "3 этап рейда - Ир Ют",
            description: "На третьем этапе рейда игроки сражаются с Ир Ют, могущественной ведьмой, песня которой способна убить того, кто услышит её до конца",
            buttons: [
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 3 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184183186227280/CE-IrYut-Map.webp",
                },
            ],
        },
        {
            name: "4 этап рейда - Крота",
            description: "Главный босс - Кроты, Сына Орикса. Вам необходимо использовать мечи, чтобы снять его щиты, нанести как можно больше урона, а затем разрушить его Сверхдушу, чтобы предотвратить вайп всей команды",
            buttons: [
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 4 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184182779387944/CE-Crota.webp",
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184183584694283/CE-LootTable.webp",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: ButtonStyle.Secondary,
                    name: "Рекомендуемое снаряжение для рейда Крах Кроты",
                    description: `> **1 и 2 этапы**\n- Любое оружие на зачистку толп противников\n\n> **3 этап**\n- 1 [Божественность](${weaponLightGGLinks.divinity}) на команду\n- Остальные берут [Дыхание Левиафана](${weaponLightGGLinks.leviBreath}) или [Владыка грома](${weaponLightGGLinks.thunderlord})\n- Также рекомендуются любые легендарные плазменные винтовки\n\n> **4 этап**\n- 1 [Буксировочная пушка](${weaponLightGGLinks.tractor}) на команду\n- Остальные берут [Плач](${weaponLightGGLinks.lament}) или [Лезвие гильотины](${weaponLightGGLinks.guillotine}) или любой хороший меч на урон`,
                },
            ],
        },
    ],
    ron: [
        {
            name: "1 этап рейда - Катаклизм",
            description: "На данном этапе игроки знакомятся с ключевой механикой рейда, которая связана с механикой «Садовников»",
            buttons: [
                {
                    label: "Подробное описание этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Распределение + Основная механика рейда",
                            description: "На первом этапе команда разделяется на две группы: садовник занимается активацией узлов посредством их последовательного соединения, а чистильщики противников помогают ему.\nЦепочку можно начать, выстрелив по полю семени.",
                            image: "https://media.discordapp.net/attachments/1134620378615001178/1157418465695633558/RoN-SeedStart.webp",
                        },
                        {
                            name: "Получение баффа",
                            description: "Затем вы получите бафф «Поле Света» или «Поток Тьмы» в случае стрельбы по полю Тьмы на последующих этапах. Обращайте внимание на луч света или тьмы, исходящий из поля.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418465364291796/RoN-SeedBeam.webp",
                        },
                        {
                            name: "Активация узла",
                            description: "Подойдите к узлу на близкое расстояние в направлении луча света и выстрелите в него. Для активации узла достаточно попасть одной пулей. Узлы можно также активировать ударом ближнего боя по полу.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418465032929370/RoN-SeedNode.webp",
                        },
                        {
                            name: "Повторение",
                            description: "После активации узла продолжайте получать бафф и активировать узлы до завершения цепочки на текущей стороне. Затем переходите на другую сторону и повторите процесс 4 раза (всего 4 стороны).",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418464684806325/RoN-SeedBuff.webp",
                        },
                        {
                            name: "Задачи остальных участников",
                            description: "Пока садовник занимается узлами, другие игроки должны увеличивать продолжительность этапа. Это можно сделать, убив мучителя после убийства двух псионов в куполах. Каждый убитый мучитель продлевает время этапа на 30 секунд.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418464248606800/RoN-Psion.webp",
                        },
                        {
                            name: "Важное уточнение для этого и последующих этапов",
                            description: "Если садовник взял бафф «Поле Света» или «Поток Тьмы» и затем (не активировав следующий узел и не дождавшись окончания 20-секундного таймера на баффе) взял его снова, произойдет дестабилизация узлов. При дестабилизации все узлы на стороне исчезают на 15 секунд и затем появляются снова на тех же местах.",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 1 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184140991533076/RoN-FirstEncounter-Map.webp",
                },
            ],
        },
        {
            name: "2 этап рейда - Деление",
            description: "Ничего нового. Та же механика с садовником света и садовником тьмы.",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Распределение",
                            description: "На втором этапе команда делится на две группы по три человека: команду света и команду тьмы. Один человек в каждой команде заранее назначается садовником.",
                        },
                        {
                            name: "Садовники",
                            description: "Садовники занимаются узлами, как на первом этапе. На этом этапе для активации узлов им придется пользоваться лифтами для перемещения с одной стороны карты на другую. Узлы появляются в следующей последовательности: 1-й, 3-й и 5-й на противоположной стороне от вашего баффа, 2-й и 4-й на вашей стороне.",
                        },
                        {
                            name: "Зачищающие",
                            description: "В то время как садовники активируют узлы, задача зачищающих — зачистить всё живое на своей стороне. После активации первого узла начнут появляться противники в белом щите на стороне света и темном щите на стороне тьмы. Для убийства таких противников необходимо получить бафф света или тьмы, встать в поле семени и дождаться садовника из вашей команды. Зачистка таких противников не является обязательной до завершения цепочки узлов на этаже, так что их можно игнорировать до момента завершения активации всех узлов.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418463866912848/RoN-Second-Shields.webp",
                        },
                        {
                            name: "Повторение",
                            description: "После того, как садовник вашей стороны сообщил о завершении активации всех узлов (или после того, как вы заметили столбы света цвета вашей стороны на карте, или когда пропал дебафф «Неминуемый выброс»), вы можете самостоятельно активировать поле узла для получения баффа. Зачистите всех оставшихся противников и идите к последнему (самому дальнему) лифту. С его помощью поднимайтесь на следующий этаж. На следующем этаже все задачи повторяются для зачищающих и садовников. Таким образом, необходимо зачистить три этажа.",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 2 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184141784264784/RoN-SecondEncounter-Map.webp",
                },
            ],
        },
        {
            name: "3 этап рейда - Макрокосм",
            description: "Этот этап не имеет связи с механиками остального рейда. Здесь мы занимаемся перемещением планет.",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Распределение",
                            description: "Команда делится на 2 группы по 3 человека: одна находится на левой стороне, другая – на правой. В каждой группе участникам назначают одну из ролей: бегуна на верхнем или нижнем этаже, либо зачищающего противников. Бегуны на нижних этажах должны быть рядом с планетами, обозначенными числами от 1 до 3, а на верхних – от 4 до 6.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184142153355384/RoN-ThirdEncounter-Map.webp",
                        },
                        {
                            name: "Начало этапа",
                            description: "После старта этапа участники сосредотачиваются на уничтожении противников в центре карты. Спустя несколько секунд появляются два центуриона в огненном щите. Убив ближайшего к одной из сторон центуриона, можно вызвать «Лейтенанта» (колосса), чье убийство активирует бафф «Планетарное зрение», открывающий цвета планет той стороны, где был убит Лейтенант.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418463124533308/RoN-ThirdEncounter-Planets.webp",
                        },
                        {
                            name: "Планетарное зрение",
                            description: "Получив бафф на левой стороне, вы видите все левые планеты белым цветом, за исключением двух. То же происходит и с правой стороной: все планеты «в темноте», кроме двух. С использованием карты нужно быстро сообщить, какие две планеты окрашены в неправильный цвет.",
                        },
                        {
                            name: "Перемещение планет",
                            description: "После определения 4-х неправильных планет (2 слева, 2 справа), верхние бегуны «берут» свои верхние неправильные планеты, а нижние берут нижние. Затем они перемещаются на противоположную сторону и «заменяют» неправильную планету там. После успешной замены в чате событий появится уведомление `Индексация планет произошла`.",
                        },
                        {
                            name: "Начало фазы урона по боссу",
                            description: "После индексации планет нужно снова убить всех противников, включая центурионов и Лейтенантов. Получив «Планетарное зрение», становятся видны центральные планеты. Нужно определить их цвета и переместить соответствующие планеты в центр. После того, как все 3 планеты будут перемещены, начинается фаза нанесения урона боссу. Босс окажется в щите света или тьмы, и для атаки его нужно встать на соответствующий бафф под планетой нужного цвета. Фаза урона аналогична 2-му этапу рейда КП. После уничтожения маленькой светящейся полоски здоровья у босса появляется возможность нанести дополнительный урон в течение нескольких секунд, после чего следует перейти под следующую кнопку.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157418462759620638/RoN-ThirdEncounter-DPS.webp",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 3 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184142153355384/RoN-ThirdEncounter-Map.webp",
                },
            ],
        },
        {
            name: "4 этап рейда - Незарек",
            description: "Это финальный этап рейда, механика которого аналогична механике с садовниками, но добавляется фаза нанесения урона боссу.",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Распределение",
                            description: "Команда делится на 2 группы по 3 человека: одна находится на левой стороне, другая — на правой. В каждой из групп у участников по одной роли: садовник, танк и зачищающий.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184140609859664/RoN-Boss-GuideMap.webp",
                        },
                        {
                            name: "Садовники",
                            description: "Обязанности садовников остаются практически такими же: им нужно заниматься узлами на своих сторонах. Кроме того, они должны активировать `островки безопасности`, помогая выжить при вайп-механике. Задача активации убежища начинается со второй фазы урона по боссу — на первой есть достаточно времени до вайпа.",
                        },
                        {
                            name: "Танки",
                            description: "Танки на этом этапе удерживают «Ненависть Незарека». Они стреляют в грудь босса для получения дебаффа и ломают плечи боссу, чтобы вызвать всплеск энергии. Это действие продолжается до завершения построения узлов всеми садовниками.",
                        },
                        {
                            name: "Зачищающие",
                            description: "Зачищающие необходимы для эффективного уничтожения всех врагов, мешающих садовникам активировать узлы.",
                        },
                        {
                            name: "Начало фазы урона по боссу",
                            description: "После завершения построения узлов садовниками начинается фаза нанесения урона боссу. Если основная часть здоровья босса уничтожена, начинается финальная фаза, в которую необходимо добить босса за короткий промежуток времени.",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 4 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184140609859664/RoN-Boss-GuideMap.webp",
                },
                {
                    label: "Босс во время этапа",
                    style: ButtonStyle.Secondary,
                    name: "Внешний вид босса при разных условиях",
                    description: "В течение этапа босс принимает разные облики, такие как: облик на начало этапа (Immune), облик во время нанесения урона по боссу (DPS), облик во время вайпа (Wipe Casting) и облик при всплеске света или тьмы (Light/Dark attunement).",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184142950281287/RoN-Nezarec.webp",
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184141364822118/RoN-LootTable.webp",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: ButtonStyle.Secondary,
                    name: "Рекомендуемое снаряжение для рейда Источник кошмаров",
                    description: `> **1 и 2 этапы**\n- Любое оружие на зачистку толп противников\n\n> **3 и 4 этапы**\n- Обязателен 1 (не больше) [Гьяллархорн](${weaponLightGGLinks.gjallarhorn}) на команду\n- Любые легендарные ракетницы ([Забияка](${weaponLightGGLinks.hothead}), [Пальмира-Б](${weaponLightGGLinks.palmira}), [Холодный прием](${weaponLightGGLinks.coldcomfort}))\n- [Бремя идзанаги](${weaponLightGGLinks.izanagi}) / до 1 на команду [Горстка пепла](${weaponLightGGLinks.witherhoard}) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот\n- До 1 на команду [Буксировочная пушка](${weaponLightGGLinks.tractor})`,
                },
            ],
        },
    ],
    kf: [
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184169982562324/KF-LootTable.webp",
                },
                {
                    label: "Руны на секретный сундук",
                    style: ButtonStyle.Secondary,
                    name: "Карта рун на секретный сундук",
                    description: "Необходимо узнать какие символы будут активны под порталом после активации 6 статуй на входе\nЭти 3 символа активируются в течение рейда\nЕсли активировать не все или активировать и не деактивировать неверный, то сундук не появится\nПосле активации всех нужных рук прозвучит оповещение и появится соответствующая надпись",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184142514061383/KF-RedBorder-Map.webp",
                },
                {
                    label: "Карта лабиринта",
                    style: ButtonStyle.Secondary,
                    name: "Карта лабиринта после второго этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184169315676190/KF-Labyrinth.webp",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: ButtonStyle.Secondary,
                    name: "Рекомендуемое снаряжение для рейда Гибель Короля",
                    description: "> **1 этап**\n- Любое оружие на зачистку толп противников\n\n> **2, 4, 5-ые этапы**\n- Обязателен 1 (не больше) [Гьяллархорн](https://www.light.gg/db/ru/items/1363886209/%D0%B3%D1%8C%D1%8F%D0%BB%D0%BB%D0%B0%D1%80%D1%85%D0%BE%D1%80%D0%BD) на команду\n- Любые легендарные ракетницы ([Забияка](https://www.light.gg/db/ru/items/4255171531/%D0%B7%D0%B0%D0%B1%D0%B8%D1%8F%D0%BA%D0%B0/), [Пальмира-Б](https://www.light.gg/db/ru/items/3489657138/%D0%BF%D0%B0%D0%BB%D1%8C%D0%BC%D0%B8%D1%80%D0%B0-%D0%B1/))\n- [Бремя идзанаги](https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/) / до 1 на команду [Горстка пепла](https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот\n\n> **3 этап**\n- Для людей, которые занимаются баффом: [Буксировочная пушка](https://www.light.gg/db/ru/items/3580904581/%D0%B1%D1%83%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%BE%D1%87%D0%BD%D0%B0%D1%8F-%D0%BF%D1%83%D1%88%D0%BA%D0%B0), любые снайперские винтовки\n- Любые хорошие линейно-плазменные винтовки ([Катаклизм](https://www.light.gg/db/ru/items/999767358/%D0%BA%D0%B0%D1%82%D0%B0%D0%BA%D0%BB%D0%B8%D0%B7%D0%BC/), [Тайпан-4fr](https://www.light.gg/db/ru/items/1911060537/%D1%82%D0%B0%D0%B9%D0%BF%D0%B0%D0%BD-4fr/)) \n- [Бремя идзанаги](https://www.light.gg/db/ru/items/3211806999/%D0%B1%D1%80%D0%B5%D0%BC%D1%8F-%D0%B8%D0%B4%D0%B7%D0%B0%D0%BD%D0%B0%D0%B3%D0%B8/) / до 1 на команду [Горстка пепла](https://www.light.gg/db/ru/items/2357297366/%D0%B3%D0%BE%D1%80%D1%81%D1%82%D0%BA%D0%B0-%D0%BF%D0%B5%D0%BF%D0%BB%D0%B0/) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот",
                },
            ],
        },
    ],
    vog: [
        {
            name: "Вход рейда - Руины пробуждения — Поднять шпиль",
            description: "Вход в рейд «Хрустальный чертог»",
            buttons: [
                {
                    label: "Подробное объяснение задачи",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Открытие прохода",
                            description: "Команда делится на 3 пары\n\nПлатформ несколько, а именно 3: левая, центральная и правая\nКаждая пара игроков занимает свою синхроплатформу и активирует ее\nВо время обороны платформы от минотавров вексов, которые сбрасывают активацию платформы, на ней необязательно стоять всё время\nПосле полного формирования шпиля, появится надпись - «Шпиль активизировался»",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157421005208289371/VoG-Entrance.webp",
                        },
                    ],
                },
            ],
        },
        {
            name: "1 этап рейда - Колодец Храмовника",
            description: "Защитите три слияния от волн вексов, препятствуя их интеграции. На этом этапе босс ещё неуязвим",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Основная задача",
                            description: `Игроки распределяются на 3 пары и обороняют слияния вексов от 3 волн противников\nВ слияние может интегрироваться не более 4 вексов или 1 виверна\nВ течение этапа появляются ${emojis.overload} Перегруженные минотавры`,
                        },
                        {
                            name: "Первая фаза - одно слияние",
                            description: "Слияние (как и виверны) появляется только в центре",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157421005602557992/VoG-First-Enc-First-Phase.webp",
                        },
                        {
                            name: "Вторая фаза - два слияния (левое и правое)",
                            description: "Слияние в центре пропадает (вместе с всеми вивернами), а после этого появляются слияния на левой и правой сторонах",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157421005921337426/VoG-First-Enc-Second-Phase.webp",
                        },
                        {
                            name: "Третья фаза - три слияния (левое, центральное и правое)",
                            description: "Боковые слияния пропадают. Через некоторое время появляются все три слияния - левое, центральное и правое\nПосле обороны всех слияний они пропадают, и этап завершается",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157421006361722900/VoG-First-Enc-Third-Phase.webp",
                        },
                        {
                            name: "Дебафф «Метка устранения»",
                            description: "После убийства взрывающихся вексов под ними появляется `лужа`, встав в которую Вы получите дебафф, который убьет Вас когда босс произведет «Ритуал устранения»\nЗа несколько секунд перед этим появится надпись «Храмовник готовится к ритуалу устранения»\nДля сброса этого дебаффа необходимо встать в колодец света в центре карты\n\nПосле того, как кто-то зайдет в колодец он пропадает на некоторое время, а поэтому предупредите команду перед этим",
                        },
                    ],
                },
            ],
        },
        {
            name: "2 этап рейда - Колодец Храмовника - Оракулы",
            description: "Необходимо уничтожать оракулы в нужном порядке на протяжении 5 волн",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Задача этапа",
                            description: "Необходимо уничтожать появляющиеся оракулы в правильной последовательности на протяжении 5 волн\nОракулы появляются в разных местах: 3 слева, 3 справа и 1 по центру",
                            image: "https://media.discordapp.net/attachments/1134620378615001178/1157421003845156924/VoG-Second-Encounter-Oracles.webp",
                        },
                        {
                            name: "Появление оракулов",
                            description: "При появлении надписи «Оракулы готовятся спеть припев» (слева снизу, над суперспособностью), **запомните последовательность** появления оракулов\nЭта последовательность повторится дважды",
                        },
                        {
                            name: "Уничтожение оракулов",
                            description: "При появлении надписи «Храмовник призывает оракулов», уничтожьте оракулы в той последовательности, в которой они появились\nЕсли сделано верно, появится надпись «Оракулы узнают припев»",
                        },
                        {
                            name: "Ошибки и очистка",
                            description: "Если оракулы уничтожены в неправильной последовательности, то игроки получат дебафф «Метка устранения»\nЕсли не сбросить дебафф, то Храмовник убьет всех игроков под ним через некоторое время\nДля его сброса необходимо встать всей команде в колодец света в центре карты (как на предыдущем этапе)\n\nКолодец света может появиться всего 3 раза - можно допустить не более 3 ошибок за этап\nПосле ошибки оракулы появятся в той же последовательности, что и были",
                        },
                        {
                            name: "Повторение",
                            description: "Уничтожайте оракулы в той последовательности, в которой они появились в течение 5 волн\nС каждой последующей волной будет добавляться дополнительный оракул (макс. - 7), после финальной волны этап будет пройден",
                        },
                    ],
                },
            ],
        },
        {
            name: "3 этап рейда - Колодец Храмовника - убийство Храмовника",
            description: "Используйте Эгиду для разрушения щита Храмовника, предотвращайте его телепортации, уничтожьте оракулы и убейте босса",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Эгида",
                            description: "Один игрок должен взять Эгиду в центре карты (ранее там был колодец света)\nЭгида используется для разрушения щита Храмовника с помощью её суперспособности, у неё также есть обычные атаки и купол, который появляется при блокировке",
                        },
                        {
                            name: "Задача игрока с Эгидой",
                            description: "Разрушьте щит Храмовника суперспособностью Эгиды, а затем предотвращайте телепортацию босса, стоя на месте телепорта",
                        },
                        {
                            name: "Задача остальных игроков",
                            description: "Дождитесь получения дебаффа после разрушения оракулов боссом, а после все одновременно войдите в колодец света (**не входите в него до получения дебаффа!**)\nКолодец может появиться всего 3 раза\nЗатем игрок с Эгидой разрушает щит Храмовника с помощью суперспособности, а все остальные наносят урон по боссу в это время",
                        },
                        {
                            name: "Повторение",
                            description: "Если босс телепортировался, то уничтожьте оракулы (или опять сбросьте дебафф в колодце света), дождитесь пока игрок с Эгидой не восстановит суперспособность и повторите фазу урона",
                        },
                        {
                            name: "Дебафф «Плен»",
                            description: "Один случайный игрок получит дебафф «Плен» после разрушения щита Храмовника\nЕсли в течение 15 секунд плененного игрока не освободят, то он умрет\nВнутри купола Вы не сможете стрелять, использовать способности и Ваше движение будет замедлено\nДругой участник вашей команды должен освободить Вас, разрушив купол",
                        },
                    ],
                },
                {
                    label: "Карта лабиринта",
                    style: ButtonStyle.Secondary,
                    name: "Карта лабиринта после этапа",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184169621856296/VoG-Labyrinth.webp",
                },
            ],
        },
        {
            name: "4 этап рейда - Хрустальный чертог - Пробудить Хрустальный престол",
            description: "Проявите три слияния вексов, используя порталы и передавая друг другу Эгиду",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Подготовка",
                            description: "Поделитесь на две группы по три человека, каждая группа отвечает за свой портал и слияние вексов внутри",
                        },
                        {
                            name: "Активация порталов",
                            description: `Активируйте порталы, встав на платформы и захватив их, а после защищайте их от ${emojis.overload} Перегруженных минотавров вексов`,
                        },
                        {
                            name: "Оборона слияний вексов",
                            description: "По одному игроку из каждой группы входят в порталы и защищают слияние вексов внутри\nЕсли в слияние интегрируется одна виверна/минотавр или три векса - все игроки умрут",
                            image: "https://media.discordapp.net/attachments/1134620378615001178/1157421006714048602/VoG-Gatekeeper-First-Part.webp",
                        },
                        {
                            name: "Использование Эгиды",
                            description: "Когда в одном из порталов появляется минотавр с неуязвимым щитом, игрок в этом портале предупреждает своего союзника по стороне об этом\nСоюзник, услышав об этом, берет Эгиду в центре карты и идет в свой портал\nТам он убивает минотавра с помощью Эгиды и передает её союзнику в портале (нужно сменить оружие - Эгида выпадет из рук)",
                        },
                        {
                            name: "Передача Эгиды",
                            description: "После передачи Эгиды другой союзник подбирает его\nЗатем он выходит из портала с ней и передает её другому игроку из другой команды и ждет когда игрок из другой команды принесет ему Эгиду обратно\nИгрок, которому принесли Эгиду, подбирает её и повторяет процесс убийства минотавра и передачи Эгиды",
                        },
                        {
                            name: "Оборона центрального слияния",
                            description: "Когда появляется центральное слияние, все игроки выходят из порталов и собираются в центре карты защищая его до конца этапа, используя Эгиду для уничтожения минотавров с неуязвимыми щитами\nВсего надо убить троих минотавров (первый появляется в конце локации, второй - справа, третий - слева) и троих виверн после них",
                            image: "https://media.discordapp.net/attachments/1134620378615001178/1157421007037022248/VoG-Gatekeeper-Second-Part.webp",
                        },
                    ],
                },
            ],
        },
        {
            name: "5 этап рейда - Хрустальный чертог - Уничтожить Атеона",
            description: "Сразитесь с Атеоном, уничтожив оракулы в порталах в нужной последовательности",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Начало этапа и портал",
                            description: "Через 80 секунд после начала этапа Атеон телепортирует трех случайных игроков в один из порталов\nТелепортированные игроки говорят остальной команде в каком они портале (если локация красная - Марс, левый портал, а если зеленая - Венера, правый)\nОдин из не телепортированных игроков открывает названый портал, а после открытия портала уходит помогать остальной команде называть оракулы и зачищать противников",
                            image: "https://media.discordapp.net/attachments/1134620378615001178/1157421004272959498/Vog-Atheon-Oracles.webp",
                        },
                        {
                            name: "Оракулы",
                            description: "Оставшиеся игроки сообщают телепортированным игрокам последовательность появления оракулов (пример: 135), а телепортированные игроки уничтожает оракулы в названом порядке (пример: сначала 1, потом 3, 5)",
                            image: "https://media.discordapp.net/attachments/1134620378615001178/1157421004843401366/Vog-Atheon-Portal-Side.webp",
                        },
                        {
                            name: "Дебафф «Метка пустоты»",
                            description: "После телепортации, на игроков в портале будет постоянно накапливаться дебафф «Метка пустоты», который будет затемнять экран\nДля его сброса одному из игроков необходимо взять Эгиду в месте, где оказываются игроки после телепортации и зажать (на секунду-2) кнопку блока как на мече (по умолч. `C`)\nСбрасывайте дебафф по просьбам союзников или где-то раз в 5-10 секунд",
                        },
                        {
                            name: "Фаза нанесения урона, ч.1",
                            description: "Игроки вне порталов называют суммарно 9 точек появления оракулов - по 3 оракула за группу\n\nПримерно на 7-8 оракуле игроки собираются на лестнице в сторону босса у портала, из которого должны выйти телепортированные игроки\nСразу после уничтожения 9 оракула всем игрокам дается бафф «Месть времени», который значительно ускоряет восстановление суперспособностей, а также позволяет наносить урон по боссу - после получения баффа сразу стоит наносить урон по боссу!",
                        },
                        {
                            name: "Фаза нанесения урона, ч.2",
                            description: "После уничтожения 9 оракула всем игрокам в портале необходимо как можно быстрее переместиться к остальным игрокам через портал, который они ранее открыли (не забудьте забрать с собой Эгиду! Если Эгида будет лежать на земле более 10 секунд, то она убьет всю команду)\n\nЧерез 15 секунд после начала фазы урона (на баффе «Месть времени» будет 15 секунд) на случайного игрока наложится дебафф «Грядущее задержание»\nИгрок с дебаффом «Грядущее задержание» должен отойти от группы (на метров 10-25) и предупредить их об этом\nОстальные игроки должны разрушить его клетку (обычно это делает игрок с Эгидой)",
                        },
                        {
                            name: "Повторение",
                            description: "Если Атеон не был убит в течение фазы, то весь цикл повторяется без каких-либо изменений",
                        },
                    ],
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184143336149032/VoG-LootTable-Ru.webp",
                },
                {
                    label: "Полная карта рейда",
                    style: ButtonStyle.Secondary,
                    name: "Карта рейда",
                    description: "Откройте карту в полном размере с помощью кнопки снизу в изображении",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184168959152138/VoG-FullMap.webp",
                },
            ],
        },
    ],
    dsc: [
        {
            name: "Вход в рейд и путь до первого этапа",
            description: "",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Зачистка мобов и предэтапье - Выжить в снежной буре",
                            description: "Игроки появляются в локации Руины Ивентайда. Их задача спуститься и пройти чуть дальше, где нужно зачистить территорию от падших, после чего откроется люк, в который им предстоит зайти\n\nСпустившись в люк, нужно немного пройтись или проехаться на сперроу до шлюза, который ведет в самую первую локацию",
                        },
                        {
                            name: "Выжить в снежной буре",
                            description: "Задача игроков - преодолеть снежную бурю, перемещаясь на сперроу по тепловым пузырям до первого этапа. Как только шлюз откроется, игроки окажутся в первом из куполов, всего их 7, учитывая первый. Когда игрок выходит из купола, на него накладывается дебафф «Обморожение». При накоплении 10 стаков игрок умирает. Внутри купола дебафф быстро сбрасывается. Когда вы будете ехать из одного купола в другой, на пути будут лежать мины падших, которые при взрыве будут ослеплять и замедлять. В случае смерти игрока, он появится в последнем куполе, который проезжал **и зачистил**. В качестве указателей до последнего купола являются фонари, расположенные по дороге. Рядом с последним куполом, помимо обычных падших, находятся два брига и шлюз, в который игрокам необходимо зайти, чтобы пройти дальше\n\nЗаметка: Чтобы пройти в шлюз далее, к этапу, достаточно половине боевой группы зайти в шлюз и прижаться к закрытой двери (или бежать в неё). Если мобы почищены, вас пустит дальше",
                        },
                        {
                            name: "Секретный сундук",
                            description: "**Заметка:** Если смотреть на дверь шлюза, справа от купола находится секретный сундук",
                        },
                    ],
                    attachments: [
                        {
                            url: "https://cdn.discordapp.com/attachments/1134620378615001178/1134626728770285619/guide.mp4",
                            name: "Путь до секретного сундука",
                        },
                    ],
                },
                {
                    label: "Карта пути",
                    style: ButtonStyle.Primary,
                    name: "Карта пути",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184167457595443/DSC-Entrance-Map.webp",
                },
            ],
        },
        {
            name: "1 этап - Система охраны Склепа",
            description: "Задача игроков обойти систему безопасности. Для этого необходимо уничтожить шесть конденсаторов (три на тьме, три на свету), которые закрыты щитом",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Механика рейда - Аугментации",
                            description: `С данного этапа и на всех последующих этапах будут доступны аугментации. На первом этапе присутствуют две аугментации: ${emojis.operator} Оператор (красный) и ${emojis.scanner} Сканер (желтый).\n\n- ${emojis.operator} **Оператор** имеет возможность взаимодействовать с консолями, подсвеченными красным цветом.\n- ${emojis.scanner} **Сканер** выделяет желтым цветом "правильные" объекты, будь то консоли или сундуки.\n\nАугментации можно передать друг другу с помощью **терминалов**, которые находятся на каждом этапе рейда.`,
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420056557387908/DSC-Terminal.webp",
                        },
                        {
                            name: "Прохождение этапа",
                            description: `Чтобы снять щит, игроки делятся на 2 группы: 4 человека идут на тьму, а 2 остаются на "светлой" стороне. Этап начинается, когда один из игроков берет оператора. Затем человек-оператор стоит у двери, позволяющей спуститься вниз, и ожидает человека-сканера.\n\nКогда этап начался, с обеих сторон начнут выходить противники, которых нужно убить. Кроме того, на тьме появляется падший-вандал с аугментацией **сканера** над головой. Его нужно убить, и **человеку-сканеру** подобрать аугментацию, после чего назвать 2 подсвеченные **желтым цветом** консоли. Затем человек-сканер переходит на светлую сторону и называет 2 желтые консоли на свету, а **человек-оператор** спускается вниз.\n\nКогда человек-оператор спустился вниз, его задача - отстрелить названные сканером консоли. Если он отстрелит неверную, сработает защита, и нижний этаж загорится, убив игрока. Этаж начнет гореть также, если **оператор** будет находиться на этаже слишком долго.\n\nОстальные игроки должны зачищать врагов. Иногда будут появляться ${emojis.overload} Перегруженные воители, поэтому имеет смысл взять что-то против них.\n\n**ВАЖНО:** Периодически появляется прислужник, блокирующий терминалы, поэтому его нужно убивать как можно быстрее.`,
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420055089385522/DSC-First-Encounter-Terminals.webp",
                        },
                        {
                            name: "Фаза нанесения урона по батареям",
                            description: `Когда **оператор** правильно отстреливает все 4 консоли, начинается фаза урона по батареям, сопровождающаяся звуковым сигналом и поднятием щитов у батарей.\n\nЧеловек-оператор должен передать свою аугментацию, и любой человек без аугментации должен её взять. Затем человек-сканер передает свою аугментацию вниз.\n\nИгрок снизу забирает её, тем самым подсвечивая какую батарею нужно атаковать для уничтожения. Например, он скажет "свет право", то игроки сверху должны атаковать эту батарею. **Оператор** продолжает называть батареи, пока не закончится фаза.\n\n**Важно:** Если выстрелить в неверную батарею, это приведет к вайпу команды.`,
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420054216966224/DSC-Basement.webp",
                        },
                        {
                            name: "Повторение",
                            description: `Если игроки сломают все 6 батарей за одну фазу, этап завершится, и на тьме появится сундук рядом с дверью к следующему этапу.\n\nЕсли же фаза закончится раньше, игрок снизу называет 4 консоли, например, 25 тьма, 14 свет, после чего его выпускает человек, взявший аугментацию оператора перед фазой урона, отстреливая консоли. Затем процесс повторяется, пока не будут уничтожены все батареи.`,
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 1 этапа",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184167025577994/DSC-Basement-Map.webp",
                },
            ],
        },
        {
            name: "2 этап - Атракс-1, падшая экзо",
            description: "Задача игроков — уничтожить Атракс-1, убивая ее копии.",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Механика рейда - Аугментации",
                            description: `- ${emojis.operator} **Оператор** (красный) - отстреливает терминалы и репликации Атракс\n- ${emojis.scanner} **Сканер** (желтый) - позволяет увидеть Атракс, которую нужно дамажить\n\nАугментации можно передавать с помощью терминалов, расположенных на каждом этапе`,
                        },
                        {
                            name: "Прохождение этапа",
                            description: "Этап начинается, когда один из игроков подойдет к фиолетовому шарику\nГруппа делится на 2 группы - 4 игроков отправляются на орбитальную станцию с помощью лифтов, остальные 2 зачищают внизу. \n\nИгрокам нужно зачищать падших и ждать появления прислужников. Их появление сопровождается звуком. Вместе с прислужниками выходят и два вандала. Снизу выходит **вандал-Оператор**, сверху - **вандал-Сканер**. Игроки должны подобрать аугментации, и, **игрок-оператор** должен спустить два лифта вниз, чтобы он и его напарник поднялись наверх.\n\n**ВАЖНО:** Если вы убьете ВСЕХ 6 прислужников, начнется дамаг фаза по атракс. Если вы хотите дождаться союзников снизу, оставьте правого прислужника на добивание, чтобы быстро его убить. Также, дамаг фаза может начаться сама по себе спустя какое-то время, даже если где-то не убили прислужника.",
                        },
                        {
                            name: "Нанесение урона по боссу",
                            description: 'После убийства всех прислужников или немного подождав, начинается фаза урона, совпровождающаяся звуком, и надписью в чате "Активация протокола уничтожения". \n\n**Игрок-сканер** должен назвать одну верную Атракс, которая светится желтым цветом. Сверху это - ближняя, дальняя, левая, правая. Снизу - правая, центральная, левая ближняя/нижняя, левая дальняя/верхняя. \n\nИгроки должны подойти к этой копии как можно быстрее и, после отсчета сканера, влить ей как можно больше урона.\n\n**ВАЖНО:** Если продамажить неправильную, это приведет к мгновенному вайпу команды. Если дамажить не одновременно, нанесете гораздо меньше урона, поскольку на нанесение урона у вас 2-3 секунды. Если не успеть нанести урон или нанести мало урона, каст также приведет к вайпу.',
                        },
                        {
                            name: "Репликация Атракс",
                            description: 'После убийства Атракс, с неё выпал фиолетовый шар, который необходимо подобрать. Этот шар называется "Репликация Атракс". Если его не подобрать, из него появится новая копия босса, которая вайпнет команду.\n\nЭтот шар может сбивать **оператор**. Если же его не сбить с игрока, он умрет и также появится копия Атракс, которая вайпнет\n\n**ВАЖНО:** Если репликацию подобрал **оператор**, он может сбить её с себя при помощи рикошетных патронов, либо передав аугментацию другому человеку.\n\nТакже, если не убили Атракс за одну полноценную фазу, репликации желательно сбросить. Сделать это можно сверху, подойдя к двери с консолью, которую также может отстрелить **оператор**. После этого дверь откроется, игрок с репликацией должен зайти, дождаться пока **оператор** собьет её и выйти до того, как дверь закроется. В противном случае, как только дверь закроется, игрок за ней умрет.\n\nПосле того, как дверь закрылась, можно будет вновь открыть её через несколько минут.',
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420056116989963/DSC-Replication-Debuff.webp",
                        },
                        {
                            name: "Продолжение",
                            description: 'Если вы не убили Атракс за один этаж, сканеру, и, желательно ещё 1-2 игрокам, бежать к лифтам и спускаться вниз и там также продамажить желтую копию. Если и сейчас не добили, вновь подняться и нанести урон по одной из оставшихся трех копий, и если вновь не добили, спуститься вниз и надамажить одну из оставшихся трех снизу. После чего подняться, и ждать когда вновь выйдут прислужники и повторить все с самого начала.\n\nВ случае если вы ванфазнули или за две мини-фазы убили её, копии снизу появятся сверху. После надписи "Активирован протокол уничтожения" одна из восьми копий загорится желтым у **сканера** и вы должны подбежать к ней и нанести урон.\n\nЕсли вы не нанесли достаточное количество урона, очень быстро нужно найти из оставшихся верную копию и добить. \n\n**ВАЖНО:** когда у вас 8 копий сверху, при каждой последующей копии у вас все меньше времени чтобы нанести ей урон, в противном случае вы вайпнетесь.\n\nЕсли же вы добили Атракс, все копии исчезают, на центральной платформе появится сундук и справа откроется дверь дальше.',
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 2 этапа",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184183957995520/DSC-Atrask-Map.webp",
                },
            ],
        },
        {
            name: "3 этап - Ядерный спуск",
            description: "Задача игроков — предотвратить ядерный спуск орбитальной станции.",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Механика рейда - Аугментации",
                            description: `- ${emojis.operator} **Оператор** (красный) позволяет отстреливать консоли\n- ${emojis.scanner} **Сканер** (желтый) позволяет увидеть два нужных сундука\n- ${emojis.suppressor} **Подавитель** (синий) позволяет "застанить" босса`,
                        },
                        {
                            name: "Прохождение этапа",
                            description: "На данном этапе игрокам необходимо использовать аугментации и вносить ядра\nЧтобы начать этап, игрок/игроки должны подойти ближе к сундукам или пострелять по Таниксу.\n\nПосле начала этапа, начнут выходить падшие, которых нужно чистить. В некоторых местах появления мобов выйдут падшие с аугментами, которые нужно будет подобрать.\n\nСкорость начала фазы зависит от скорости зачистки мобов",
                        },
                        {
                            name: "Оператор(красная аугментация)",
                            description: "Задача оператора на данном этапе отстреливать одну из трех консолей, когда начнется фаза. \n\nЖелательно находиться на правом дальнем или левом дальнем месте спавна мобов.\n\nВ приоритете ВСЕГДА левая дальняя консоль. Если она неактивна, можно отстрелить или левую ближнюю, если находитесь с левой стороны, или правую дальнюю, если находитесь с правой стороны.\n\nЕсли оператор не отстрелит консоль, появится третье ядро",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420053868843038/DSC-Terminals.webp",
                        },
                        {
                            name: "Сканер(желтая аугментация)",
                            description: "Задача сканера на данном этапе назвать два ящика, которые подсвечены желтым цветом. В случае, если оператор не отстрелил консоль и появилось третье ядро, сканер увидит три светящихся ящика.\n\nНазвания всех возможных комбинаций ящиков: ближние; дальние; левые; правые; левый ближний, правый дальний или же слеш (slash); правый ближний, левый дальний или же бекслеш (backslash)",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420054648999967/DSC-Desposit-Chests.webp",
                        },
                        {
                            name: "Подавитель(синяя аугментация)",
                            description: "Задача подавителя - подавить босса. Чтобы это сделать, неоходимо встать под дроном, убедиться что босс горит синим и нанести любой урон(хватит даже единицы урона), после чего повторить с двумя оставшимися дронами.\n\nЕсли подавитель не справится со своей ролью и босс не застанится, игроки не смогут внести ядра в сундуки",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420055638835260/DSC-Guard-Node.webp",
                        },
                        {
                            name: "Игроки без аугментаций",
                            description: "Задача остальных игроков подобрать ядра и внести в сундуки, которые назвал сканер. \n\n**ВАЖНО:** Если не подобрать ядра до истечения таймера, они взорвутся, вайпнув команду.\n\nПока игрок несет ядро, он не может бежать, стрелять, подкатываться, использовать двойной прыжок. Также, на игроке начинает накапливаться **Радиация**. При накоплении 10 стаков игрок умрет, а ядро из него выпадет. \n\n**ВАЖНО:** Когда игрок внес ядро, с него постепенно будет спадать радиация, но если он вновь возьмет ядро, она вновь продолжит накапливаться\n\nДругой игрок может перехватить ядро, подойдя к носителю ядра и зажав кнопку взаимодействия. Чтобы внести ядро в ящик, также нужно зажать клавишу взаимодействия",
                        },
                        {
                            name: "Деактивация аугментации",
                            description: 'Когда игроки внесут ядра в сундуки, босс вновь начнет ходить и у одного из игроков с аугментацией появится дебафф "деактивация аугментации", что означает что его аугментация сломана и он не сможет ею воспользоваться',
                        },
                        {
                            name: "Передача аугментации",
                            description: 'Чтобы передать деактивированную аугментацию другому игроку, необходимо воспользоваться терминалом.\n\n**ВАЖНО:** В терминале максимум может храниться ОДНА аугментация. Класть её туда и забирать можно с любого места. Например, положили туда справа, забрали слева.\n\nКогда игрок со сломанной аугментацией закинет её в терминал, на него повесится дебафф **"Блокировка аугментации"** с таймером, по истечению которого игрок вновь сможет брать аугментации',
                        },
                        {
                            name: "Продолжение этапа",
                            description: "После смены игроков и аугментаций, игрокам необходимо повторить все ещё 5 раз. Чтобы узнать сколько фаз у вас ещё будет, можно посмотреть под ящики",
                        },
                        {
                            name: "",
                            description: "По окончанию шестой фазы, в центре комнаты откроется дверь, в которую нужно прыгнуть и как можно быстрее пробежать по коридору с падшими до белой комнаты. Чистить при этом падших не нужно\n\n**ВАЖНО:** Если игрок или игроки не успеют добежать и дверь в белую комнату закроется, они умрут.\n\nПосле крушения вы не сможете ходить около минуты, поскольку будет эффект подавления. Как только эффект пропадет, появится сундук и откроется дверь к финальному боссу",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 3 этапа",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184168229351485/DSC-Rapture-Map.webp",
                },
            ],
        },
        {
            name: "4 этап - Таникс-Исчадие",
            description: "Финальный босс рейда",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Механика рейда - Аугментации",
                            description: `- ${emojis.operator} **Оператор** (красный) позволяет отстреливать людей. Появляется в зоне с 1 и 2 ящиком\n- ${emojis.scanner} **Сканер** (желтый) позволяет увидеть два нужных сундука. Появляется в зоне с 3 и 4 ящиком\n- ${emojis.suppressor} **Подавитель** (синий) позволяет "застанить" босса. Появляется в зоне с 5 и 6 ящиком`,
                        },
                        {
                            name: "Прохождение этапа",
                            description: "Игроки делятся на 3 команды по 2 игрока и расходятся по трем точкам. В каждой команде должен быть человек, который возьмет аугмент, и тот, кто поможет с зачисткой мобов\n\nЭтап начинается, когда игрок(и) подойдут к груде хлама по центру, или постреляют по ней\n\nКак только этап начался, игроки должны почистить мобов. После этого выйдет капитан с пустотным щитом, после убийства которого выйдет **вандал с аугментом**, которого должны убить и забрать аугмент\n\n**ВАЖНО:** Сканер на данном этапе не особо нужен, ничего не случится, если вы его не подберете. Остальные два аугмента (**Оператор** и **Подавитель**) важны.\n\nПримерно во время подбора аугментов, Таникс пойдет либо на точку, где выходит Оператор, либо где выходит Подавитель. Игроки должны последовать за ним.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184168573280278/DSC-Taniks-Map.webp",
                        },
                        {
                            name: "",
                            description: "Когда босс пришел на одну из точек, ему необходимо отстрелить 4 реактивные турбины. После отстреливания из турбин выпадают ядра, которые необходимо подобрать игрокам без аугмента, либо со сканером.\n \n**ВАЖНО:** Пока игроки сбивают турбины, босс кастует орбитальные удары. Если игрок попадёт под удар, ему нанесет урон, а если попадет под 2 - умрет",
                        },
                        {
                            name: "",
                            description: 'После того, как игроки подобрали ядра, им необходимо внести их в ящики.\n\n**ВАЖНО:** Игроки должны внести во все ящики, кроме тех, которые на одной стороне с Таниксом.\n\nПока игроки будут нести ядра, на них будет накапливаться "Радиация". Также, одного из игроков закроет в "купол", который должен сбить **Оператор**.\n\nЗадача **Подавителя** такая же, как и на 3 этапе - встать под дрон, нанести любой урон боссу, после чего перейти под следующий дрон.',
                        },
                        {
                            name: "Фаза урона",
                            description: "Когда все игроки внесли ядра, необходимо прийти на сторону оператора и ждать начала фазы урона. Таникс же телепортируется в центр арены.\n\nКогда фаза урона начнется, вокруг Таникса появится купол, внизу которого будет летать мусор. Если встать на траекторию мусора - игрока откинет.\n\nИгрокам необходимо запрыгнуть в купол и наносить урон.\n\n**ВАЖНО:** Во время дамаг фазы, Таникс дважды выкинет игроков из купола. Чтобы продолжить наносить урон, необходимо как можно быстрее вернуться в купол.",
                        },
                        {
                            name: "",
                            description: "Это повторяется до тех пор, пока здоровье босса не опустится до уровня фазы добивания или пока купол не исчезнет. Если игроки не успели нанести достаточное количество урона до фазы добивания, им необходимо повторить механику этапа. \n\nЕсли же игроки нанесли достаточное количество урона, Таникс начнет телепортироваться между тремя зонами, и можно будет свободно наносить ему урон. Если босса не убить приблизительно после шестого телепорта, произойдет вайп. \n\n**ВАЖНО:** Во время фазы добивания, Таникс будет кастовать орбитальные выстрелы.\n\nКогда босс умрет, рейд будет окончен и появится сундук, в котором можно купить оружие и броню за трофеи.",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 4 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184168573280278/DSC-Taniks-Map.webp",
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184167906381885/DSC-LootTable.webp",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: ButtonStyle.Secondary,
                    name: "Рекомендуемое снаряжение для рейда Склеп Глубокого камня",
                    description: `> **1 этап**\n- [Ксенофаг](${weaponLightGGLinks.xenophage}), [Бастион](https://www.light.gg/db/ru/items/2415517654/%D0%B1%D0%B0%D1%81%D1%82%D0%B8%D0%BE%D0%BD/), [Тысяча голосов](https://www.light.gg/db/ru/items/2069224589/%D1%82%D1%8B%D1%81%D1%8F%D1%87%D0%B0-%D0%B3%D0%BE%D0%BB%D0%BE%D1%81%D0%BE%D0%B2/), [Уордклиффская катушка](https://www.light.gg/db/ru/items/1508896098/%D1%83%D0%BE%D1%80%D0%B4%D0%BA%D0%BB%D0%B8%D1%84%D1%84%D1%81%D0%BA%D0%B0%D1%8F-%D0%BA%D0%B0%D1%82%D1%83%D1%88%D0%BA%D0%B0/), легендарные ракетницы, плазменные винтовки и другое оружие, которое наносит большой урон не по криту (т.е. через желтые цифры)\n\n> **2 этап**\n- [Паразит](https://www.light.gg/db/ru/items/2812324400/%D0%BF%D0%B0%D1%80%D0%B0%D0%B7%D0%B8%D1%82/), [Плач](${weaponLightGGLinks.lament}), хороший легендарный меч\n\n> **3 этап**\n- Любое оружие на зачистку толп противников\n\n> **4 этап**\n- Обязателен 1 (не больше) [Гьяллархорн](${weaponLightGGLinks.gjallarhorn}) на команду\n- Любые легендарные ракетницы ([Забияка](${weaponLightGGLinks.hothead}), [Пальмира-Б](${weaponLightGGLinks.palmira}), [Холодный прием](${weaponLightGGLinks.coldcomfort}))\n- [Бремя идзанаги](${weaponLightGGLinks.izanagi}) / до 1 на команду [Горстка пепла](${weaponLightGGLinks.witherhoard}) / любая другой экзотик или легендарное оружие на хороший урон не в силовой слот`,
                },
                {
                    label: "Секретные записи",
                    style: ButtonStyle.Secondary,
                    name: "Секретные записи для призрака",
                    description: "В течение рейда вы можете найти 5 секретных записей. Собрав их все, вы получите призрака",
                    embeds: [
                        {
                            name: "1 запись",
                            description: "Перед входом в комнату первого этапа пройдите к противоположному концу коридора. За ящиками вы найдете первую запись.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1145581561807388742/DSC-SecretLog-1.jpg",
                        },
                        {
                            name: "2 запись",
                            description: "После завершения первого этапа игроки попадут в большую темную комнату со статуей из кораблей Пирамиды. Слева находится большая труба, которая проходит через всю комнату. Наверху этой трубы расположена вторая запись.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1145581562151305277/DSC-SecretLog-2.jpg",
                        },
                        {
                            name: "3 запись",
                            description: "Когда вы дойдете до большой платформы на полпути паркура в космосе, прыгните на узкие платформы справа. С диагонали от вашего местоположения вы увидите круглую платформу. Третья запись расположена на её нижнем кольце.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1145581562474274866/DSC-SecretLog-3.jpg",
                        },
                        {
                            name: "4 запись",
                            description: "Эта запись находится в конце паркура. Дойдя до вершины, поверните направо. В самом конце расположена четвертая запись.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1145581562763690004/DSC-SecretLog-4.jpg",
                        },
                        {
                            name: "5 запись",
                            description: "Перед входом в комнату третьего этапа посмотрите направо. Там расположена большая красная труба. Прыгните на неё, и на ней вы обнаружите пятую запись.",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1145581561471827998/DSC-SecretLog-5.jpg",
                        },
                    ],
                },
            ],
        },
    ],
    lw: [
        {
            name: "1 этап - Калли, оскверненная",
            description: "Первый босс, на котором фармят шмотки",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Знакомство с этапом",
                            description: "В центре зала висит 6 символов. Эти символы соответствуют тем, которые находятся над платформами\nВсего платформ 9, а это значит что 3 всегда будут лишними",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184140228165632/LW-Symbols.webp",
                        },
                        {
                            name: "Основная задача",
                            description: "Игроки выбирают себе платформу с символом, указанным в центре, и подходят к ней\nКогда каждый нашел себе платформу, они встают на них\n\nПока игрок стоит на пластине, он её захватывает\nКаждая платформа поделена на 3 части, и в двух секциях наугад появится одержимый сгусток – стоя на этих секциях, игрок погибнет через какое-то время",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420541045645462/LW-Kalli-Plates.webp",
                        },
                        {
                            name: "Появление босса",
                            description: "Пока игроки стоят на платформе, к одному из них может придти босс\nЧтобы Калли ушла, нужно пострелять по ней, либо сойти с платформы, а после её ухода, вернуться обратно",
                        },
                        {
                            name: "Завершение захвата платформы",
                            description: "Когда платформа полностью будет захвачена, на ней заспавнится одержимый рыцарь, убив которого, символ считается закрытым и исчезнет из центра",
                        },
                        {
                            name: "Фаза урона по боссу",
                            description: "Когда все игроки захватили свои платформы, они направляются к центру, где должна ожидать Калли\nКак только она телепортируется в центр, игрокам необходимо внести как можно больше дамага по ней, пока не появится надпись `Калли готовится применить онтологическое оружие`\nПосле этой надписи, игрокам необходимо распределиться и занять одну из дверей под боссом, дабы избежать смерти\n\n**Важно**, чтобы один игрок занял одну ячейку, в противном случае дверь не закроется и обоих игроков убьет вайп механикой",
                        },
                        {
                            name: "Продолжение",
                            description: "После открытия дверей, идите на следующее место телепортации и продолжайте наносить урон до появления такой же надписи, а после повторяйте механику с дверьми\nВсего босс телепортируется на 3 стороны - 3 раза открывает двери - есть 3 фазы урона по боссу\nВ случае убийства Калли, этап заканчивается, давая награды и открывая дверь дальше\nВ случае, если за 3 телепортации Калли не умерла, необходимо повторить механику с самого начала",
                        },
                    ],
                },
                {
                    label: "Альтернативное прохождение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Объяснение",
                            description: 'На этом этапе можно "застанить" босса, заставив его стоять всю фазу на одном месте. Благодаря этому, можно убить его буквально за 10 секунд, не выполняя какие-либо механики',
                        },
                        {
                            name: "Механика стана",
                            description: "Для того чтобы застанить босса, необходимо, чтобы один игрок попал **Анархией** по боссу в момент исчезновения щита, пока тот находится в центре. Перед этим один из союзников должен встать на любую платформу (лучше на ту, которая находится под флагом/входом на этап), к которой в дальнейшем придет босс, и стоять на ней до появления босса. После попадания игрок с **Анархией** идет к платформе, на которой стоит союзник, стреляет **Анархией** в пол и еще раз по боссу при его появлении.\n\nПример:",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1119768913270538311/c784eda9116227c3.gif",
                        },
                        {
                            name: "Далее",
                            description: "После этого босс должен стоять на этом же месте до начала механики с открытием дверей. За это время вы должны убить его",
                        },
                    ],
                },
                {
                    label: "Обозначение символов",
                    style: ButtonStyle.Secondary,
                    name: "Обозначение символов",
                    description: "Знание обозначений символов на этом этапе не так важно, поскольку на этом этапе необходимо лишь занимать соответствующие точки",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184140228165632/LW-Symbols.webp",
                },
            ],
        },
        {
            name: "2 этап - Шуро Чи",
            description: "Тот самый этап, где многие фармят мобов",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Дебафф-обратный отсчёт этапа",
                            description: "Как только этап начинается, у вас появляется дебафф `Песнь Шуро Чи` на 4 минуты. Когда таймер достигнет 0 секунд, этап вайпнется",
                        },
                        {
                            name: "Основная Задача",
                            description: "Игрокам необходимо как можно быстрее чистить абсолютно всех мобов, после чего в чате появится надпись `Шуро чи ускоряет темп`, а на платформах появятся 3 семечки\n3 игрока должны взять их и стрелять в правого союзника\nПосле удачной сводки, щит с босса спадает и начнется микрофаза дамага, которых всего 6\nЕсли за короткое время, пока Шуро кастует вайп механику, успеть снести 1/6 здоровья, этап продолжится, в противном случае, команда умирает\n\nНачало фазы урона:",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1119766140680421457/2a3fc75f6c7471f7.gif",
                        },
                        {
                            name: "Далее",
                            description: "После успешного снятия 1/6, необходимо продолжать следовать за Шуро Чи, параллельно зачищая мобов. Повторить фазу урона по боссу\nПосле снятия 2/6 хп у босса, она уйдет на следующий этаж, а игрокам нужно будет решить головоломку или, так называемый, калькулятор",
                        },
                        {
                            name: "Головоломка",
                            description: "Зайдя в комнату, игроки увидят 9 пластин на земле и 3 экрана на стенах, на одном из которых, будет символ с пропущенными четырмя сегментами\nКаждая из пластин на земле отвечает за сегмент на экране\n4 игрока должны определиться со своей кнопкой и встать на неё, дополнив головоломку, заполнив картинку\nЭти четыре игрока должны повторить `заполнение` картинок ещё два раза, а оставшиеся два игрока обязаны чистить мобов, чтобы они не мешали решать головомку",
                            image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157420540668162058/LW-Shuro-Puzzle.webp",
                        },
                        {
                            name: "Платформы",
                            description: "Пока игрок стоит на платформе, она наносит ему урон, используйте блок меча или любой способ восстановить себе здоровье, чтобы дольше стоять на кнопке\nОдин игрок может простоять на всех платформах, но только один раз. Если вам выпала платформа, на которой вы ранее стояли, она засветится красным. Если встать на такую платформу, она будет наносить урон, но НЕ будет заполнять недостающий сегмент. В такие моменты игроки договариваются сменить платформы (например, игрок, стоящий на 1 платформе, меняется с игроком, стоящим на 2)",
                        },
                        {
                            name: "Повторение",
                            description: "После успешного заполнения всех 3х экранов, таймер на дебаффе обновляется и игрокам выдвигаются в воздухе платформы, по которым они забираются на второй этаж\nНа втором этаже игроки снимают 3 и 4 полоски здоровья, а затем вновь идет повторение тех же механик с головоломкой в конце и поднятием на 3 этаж\nНа третьем этаже игроки снимают 5 полоску здоровья и 6, самую длинную часть\n\nПосле снятия последней части здоровья, Шуро Чи умирает, этап завершается, открывая двери дальше",
                        },
                    ],
                },
                {
                    label: "Подсказка по головоломке",
                    style: ButtonStyle.Primary,
                    name: "Руководство по прохождению калькулятора",
                    image: "https://cdn.discordapp.com/attachments/679191036849029167/1117271938885230642/fpsp6ce.gif",
                },
            ],
        },
        {
            name: "3 этап - Моргет, Хранитель Шпиля",
            description: "",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Распределение и начало этапа",
                            description: "> **Игроки делятся на следующие роли**\n- 1 игрок, который берет первый и последний бафф\n- 2 игрока, которые берут 1 бафф\n- 1 игрока, который берет 2 баффа\n- 2 игрока, которые занимаются разморозкой\nЭтап начинается, когда один из игроков подбирает сферу рядом с Моргетом и у него появляется бафф `захваченная сила`",
                        },
                        {
                            name: "Игрок, собирающий 2 баффа",
                            description: "Такой игрок обычно становится на правую сторону. Когда появляются 4 сферы, этот игрок собирает обе сферы с правой стороны. Через некоторое время Моргет повесит на него заморозку, о чем игрок должен сообщить\nПосле того как его разморозили, появляется вторая группа из 4 сфер, и он вновь собирает обе на своей стороне",
                        },
                        {
                            name: "Игрок, собирающий 1 бафф",
                            description: "Таких игроков должно быть двое, и они идут на левую сторону. Когда появляется первая волна сфер, каждый собирает по 1 сфере\nНа второй волне сфер, игроки вновь подбирают по 1 сфере",
                        },
                        {
                            name: "Вторая заморозка и начало фазы урона",
                            description: "Во время второй заморозки, может заморозить одного из трёх игроков. Второй размораживающий повторяет действия первого, после чего, в случае если почистили мобов, появляется сфера на месте той, которая стартовала этап. Игрок, который подбирал самую первую, подбирает последнюю и начинается фаза урона по Моргету",
                        },
                        {
                            name: "Разморозка союзников",
                            description: "Когда какого-либо союзника заморозили, человек, отвечающий за их разморозку, должен взять `эссенцию одержимых`, подбежать к `замороженному союзнику` и, нажав кнопку гранаты, разморозить, забрав тем самым у него `захваченную силу`",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1119764244964053022/f235e96a752d9e95.gif",
                        },
                        {
                            name: "Важно: Захваченная сила",
                            description: "Один человек может взять **МАКСИМУМ** 2 сферы - при подборе третьей, человек умирает, а все собранные сферы спавнятся на карте вновь",
                        },
                    ],
                },
            ],
        },
        {
            name: "4 этап - Хранилище",
            description: "",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Распределение",
                            description: "Игроки делятся на 2 роли по 3 человека - те, кто чистят и те, кто читают символы\nПосле распределения, чистильщик и читатель выбирает сторону: центр, камень или лес\n**Обязательно**, чтобы на каждой из сторой был ОДИН читающий и ОДИН чистящий\n\nЭтап начинается, когда читающие встанут на 3 кнопки, которые они заранее выбрали",
                        },
                        {
                            name: "Первая фаза",
                            description: "Начиная с чтеца, стоящего на центре, его задача назвать центральный символ\nЗадача читающих на лесу или камне найти этот символ у себя слева или справа, сказать об этом и назвать свой центральный символ и оставшемуся также назвать где символ находится у него и свой центральный\n\nЛевый символ означает тьму, правый символ означает свет",
                        },
                        {
                            name: "Пример фазы",
                            description: "Например, центральный называет: `змея облачко`. Она оказывается у чтеца на камне справа\nОн говорит, что камень свет (можно ещё написать об этом в чат, в виде сокращения `кс`) и называет птицу на ветке\nУ чтеца на камне она слева. Он говорит: `лес тьма` (обозначение в чате, соответственно, `лс`) и называет свой центральный и это дракон с копьем\nОн у центрального чтеца также слева, о чем он также говорит и пишет в чат `цт`\n**ВАЖНО**: на этапе **НЕ может** быть три тьмы или три света. Если у вас произошла такая ситуация, встаньте вновь на платформы и пересмотрите свои символы",
                        },
                        {
                            name: "Далее",
                            description: "После того, как чтецы назвали свои символы, они могут сходить с кнопок\n\nПримерно в это же время две комнаты `закроются` и лишь одна будет открыта. Чтецу той стороны, где дверь не закрылась, необходимо зайти в комнату и помочь чистящему с мобами, после чего в центре комнаты появится противник `Око Ривен`, после убийства которого выпадет сфера\nПри подборе чтецом этой сферы, его комната закроется, и остальные игроки должны сказать какая комната открылась\n\nЗадача чтеца, несущего сердце, пройти по туннелю справа или слева, в зависимости от названной открытой комнаты, и выйти через открытую комнату в центр\nПри подборе сферы, на чтеца навешивают дебафф `Полутьма сущности одержимых` или `Полусвет сущности одержимых`",
                        },
                        {
                            name: "Пример движений чтеца с сердцем",
                            description: "",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1119765679311171716/f10827f00226b3bc.gif",
                        },
                        {
                            name: "Внесение сущности",
                            description: "Если на баффе написано `Полусвет`, чтец, внесет в ту сторону, где был свет. Исходя из прошлого примера, чтец, выйдя на центр, внесет на камень или на лес\nЧтобы `внести` бафф, необходимо встать на необходимую кнопку и нажать кнопку гранаты\nВ случае совпадения баффов, кнопка очистится и над ней не будет висеть одержимая душа\n\n**ВАЖНО**: до того, как чтец не вышел из комнаты, второму чтецу желательно не убивать Око Ривен, чтобы дверь не закрылась прям перед носом выносящего",
                        },
                        {
                            name: "Последущие действия и фазы",
                            description: "Второй и третий чтецы должны повторить действия первого\nВ случае удачи и очистки всех 3х пластин, этап переходит на следующую фазу, и чтецы должны повторить все действия ещё два раза\n\nНа третьей фазе, в случае успешной очистки всех трех кнопок, этап заканчивается и открывается путь дальше",
                        },
                        {
                            name: "Задача зачищающих противников",
                            description: "Роль чистящего чистить мобов в комнате и не позволять название моба пройти через занавесу и вонзить меч в кнопку. Если он это сделал, у вас есть 5 секунд, чтобы его убить, а иначе он убьет всю команду\n\n**ВАЖНО**: Если вы чистильщик и у вас случайно вышел рыцарь из комнаты, сразу скажите об этом. Например: `Из леса вышел рыцарь, помогите`",
                        },
                    ],
                    attachments: [
                        {
                            name: "Пример чтения символов",
                            url: "https://cdn.discordapp.com/attachments/1115151918839386122/1118104978054205510/1.mp4",
                        },
                    ],
                },
                {
                    label: "Обозначение символов",
                    style: ButtonStyle.Secondary,
                    name: "Обозначение символов",
                    description: "",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184140228165632/LW-Symbols.webp",
                },
            ],
        },
        {
            name: "5 этап - Тысечеголосая Ривен",
            description: "",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Начало этапа",
                            description: "Этап начинается, как только все 6 игроков встанут на все платформы. Они провернутся и откроются, а игроки начнут падать вниз",
                        },
                        {
                            name: "Поиск Ривен",
                            description: "Когда этап начался, игрокам необходимо повернуть голову к синей двери и зайти в эту комнату\nЗатем, когда в чате напишет текст, нужно посмотреть на экран\nВ случае, если её тень проплыла по экрану, остаться в комнате и зачищать мобов\nВ случае, если тени не было, подойти к стене и начать `присоединение к союзникам`, после чего повернуть направо и упасть в другую комнату\n\nПосле зачистки мобов, вам необходимо ждать, пока Ривен не выйдет",
                            image: "https://cdn.discordapp.com/attachments/679191036849029167/1120134396683493386/251a3a2d302cd4f4.gif",
                        },
                        {
                            name: "Финальная фаза Ривен",
                            description: "После того, как она выйдет, необходимо как можно быстрее снести все её здоровье до маленькой полоски, в противном случае она вас убьет\nПосле нанесения достаточного количества урона, Ривен телепортирует вас в высшее измерение, в котором задача пройти наверх и забрать сферу, как на Моргете\nКогда один из игроков забрал эту сферу, вас телепортирует наверх в обычный мир, где Ривен вновь выходит и вас уже необходимо снять оставшуюся полоску\nКак только был нанесен смертельный урон, Ривен погибает, открывая рот\nВ этот рот необходимо зайти и уничтожить сердце\nКогда сердце было убито, оно превращается в шар, и падает на пол, а игрокам выдают ключ",
                        },
                    ],
                    attachments: [
                        {
                            name: "Пример появления тени Ривен",
                            url: "https://cdn.discordapp.com/attachments/1115151918839386122/1118109705487790111/c59c4159a1e3e937.mp4",
                        },
                        {
                            name: "Путь, если Ривен в другой комнате",
                            url: "https://cdn.discordapp.com/attachments/1115151918839386122/1120365163233685574/1.mp4",
                        },
                    ],
                },
            ],
        },
        {
            name: "6 этап - Сердце Ривен",
            description: "",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "Основная Задача",
                            description: "Игрокам необходимо пронести сердце до конца\n\nПосле того, как сердце стало шаром, оно выбирает одного случайного игрока, на котором появляется бафф `Перст судьбы`\n**ВАЖНО**: только человек с этим баффом может брать сердце и нести его",
                        },
                        {
                            name: "Начало этапа и первый бегун",
                            description: "Игрок должен подойти к сердцу и взять его, после чего у игрока появится бафф `Перст судьбы`, который является таймером\nНачиная с 10 секунд, избранный должен в слух отсчитывать до 0, а игроки рядом с ним должны отходить от носящего на 2-3 секунде\nПо истечению таймера, игрок, несущий сердце, будет телепортирован в другое измерение, а сердце выберет избранного из оставшихся\n**ВАЖНО**: когда у несущего сердце истекает таймер, те, кто не отойдет от него, будут телепортированы вместе с несущим в другое измерение",
                        },
                        {
                            name: "Механика тьмы",
                            description: "Пока сердце находится у кого-то в руках, вокруг этого игрока образуется купол, а также человек с сердцем не может стрелять, поэтому оставшиеся люди должны защищать его от мобов\nПока игроки находятся вне этого купола, на них накапливается дебафф\nКогда будет этого дебаффа х10, игрок умирает, а его призрак телепортируется в другое измерение",
                        },
                        {
                            name: "Астральное измерение",
                            description: "Когда игроки попадают в другое измерение, их задача выжить путем чистки мобов. Также, в том измерении будут появляться сферы, как на Моргете\nПри подборе последней сферы, в чате пишется `сердце Ривен бьется медленее`, а таймер у избранного обновляется до 15 секунд\n\nВАЖНО: Стоит подбирать данные сферы, когда избранный говорит `3, 2, 1`. Лучше всего на 2 секунде",
                        },
                        {
                            name: "Завершение",
                            description: "В конце пути игрока(ов) будут ожидать спасенные техноведьмы (Калли и Шуро Чи)\nИгроку необходимо внести сердце, которое при вносе очищают техноведьмы и рейд считается пройденным\n\nПосле диалога, на лестнице у статуй появятся сундуки, которые можно открыть только при наличии особого ключа",
                        },
                    ],
                    attachments: [
                        {
                            name: "Прохождение этапа",
                            url: "https://cdn.discordapp.com/attachments/1115151918839386122/1120365891167715338/1_1.mp4",
                        },
                    ],
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184139838099537/LW-LootTable.webp",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: ButtonStyle.Secondary,
                    name: "Рекомендуемое снаряжение для рейда Последнее Желание",
                    description: `> **2, 4, 6 этапы**\n- Любое оружие на зачистку толп противников\n\n> **5 этап**\n- [Плач](${weaponLightGGLinks.lament}) или любой другой хороший легендарный меч\n- До 1 на команду [Буксировочная пушка](${weaponLightGGLinks.tractor})`,
                },
            ],
        },
    ],
    test: [
        {
            name: "Начало рейда",
            description: "",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "placeholder",
                            description: "placeholder",
                        },
                    ],
                },
            ],
        },
        {
            name: "1 этап рейда - Бездна",
            description: 'Игроки будут прокладывать путь через лабиринт, окутанный темнотой. В темноте на вас постепенно накладывается дебафф "Тяжесть Тьмы", который увеличивается до десяти уровней, замедляя движение и лишая возможности бегать и прыгать. Чтобы сбросить дебафф, нужно подойти к лампам, указывающим путь из лабиринта',
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "placeholder",
                            description: "placeholder",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 1 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184182028615761/CE-Abyss.webp",
                },
            ],
        },
        {
            name: "2 этап рейда - Трон Сверхдуши",
            description: "Игрокам предстоит пересечь пропасть и уничтожить особых врагов – Хранителей Врат. Цель этой этапа - переправить всех игроков через мост, убить пять Хранителей, сохранить реликвии мечей, а затем уничтожить еще пять Хранителей Врат",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "placeholder",
                            description: "placeholder",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 2 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184182372532244/CE-Bridge.webp",
                },
            ],
        },
        {
            name: "3 этап рейда - Ир Ют",
            description: "На третьем этапе рейда игроки сражаются с Ир Ют, могущественной ведьмой, песня которой способна убить того, кто услышит её до конца",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "placeholder",
                            description: "placeholder",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 3 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184183186227280/CE-IrYut-Map.webp",
                },
            ],
        },
        {
            name: "4 этап рейда - Крота",
            description: "Главный босс - Кроты, Сына Орикса. Вам необходимо использовать мечи, чтобы снять его щиты, нанести как можно больше урона, а затем разрушить его Сверхдушу, чтобы предотвратить вайп всей команды",
            buttons: [
                {
                    label: "Подробное объяснение этапа",
                    style: ButtonStyle.Primary,
                    embeds: [
                        {
                            name: "placeholder",
                            description: "placeholder",
                        },
                    ],
                },
                {
                    label: "Карта этапа",
                    style: ButtonStyle.Primary,
                    name: "Карта 4 этапа",
                    image: "https://cdn.discordapp.com/attachments/1134620378615001178/1157184182779387944/CE-Crota.webp",
                },
            ],
        },
        {
            name: "Полезная информация по рейду",
            buttons: [
                {
                    label: "Награды за этапы рейда",
                    style: ButtonStyle.Secondary,
                    name: "Награды за этапы рейда",
                    image: "https://media.discordapp.net/attachments/1134620378615001178/1157184183584694283/CE-LootTable.webp",
                },
                {
                    label: "Рекомендуемое снаряжение",
                    style: ButtonStyle.Secondary,
                    name: "Рекомендуемое снаряжение для рейда Крах Кроты",
                    description: `> **1 и 2 этапы**\n- Любое оружие на зачистку толп противников\n\n> **3 этап**\n- 1 [Божественность](${weaponLightGGLinks.divinity}) на команду\n- Остальные берут [Дыхание Левиафана](${weaponLightGGLinks.leviBreath}) или [Владыка грома](${weaponLightGGLinks.thunderlord})\n- Также рекомендуются любые легендарные плазменные винтовки\n\n> **4 этап**\n- 1 [Буксировочная пушка](${weaponLightGGLinks.tractor}) на команду\n- Остальные берут [Плач](${weaponLightGGLinks.lament}) или [Лезвие гильотины](${weaponLightGGLinks.guillotine}) или любой хороший меч на урон`,
                },
            ],
        },
    ],
};
export default raidGuide;
//# sourceMappingURL=raidGuideData.js.map