const roleRequirements = {
    284821378: "За сбор всех мотыльков Сияющего Улья в мире-Престоле",
    2202038969: "За нахождение всех кроликов на Луне",
    3718971745: "За «Тиски алчности»",
    3191784400: "За «Откровение»",
    3205009787: "За «Расколотый трон»",
    3950599483: "За «Яма ереси»",
    4126703847: "За «Дуальность»",
    4032136335: "За «Шпиль хранителя»",
    999999999999: "За [REDACTED]",
};
const dungeonsTriumphHashes = [3718971745, 3191784400, 3205009787, 3950599483, 4126703847, 4032136335, 2105117002];
export { dungeonsTriumphHashes, roleRequirements };
