const roleRequirements = {
    284821378: "За сбор всех мотыльков Сияющего Улья в мире Престола",
    2202038969: "За нахождение всех кроликов на Луне",
    3314823583: "За нахождение всех растений и уникальных образцов флоры в заданиях «Погружение»",
    3718971745: "За «Тиски алчности»",
    3191784400: "За «Откровение»",
    3205009787: "За «Расколотый трон»",
    3950599483: "За «Яма ереси»",
    4126703847: "За «Дуальность»",
    4032136335: "За «Шпиль хранителя»",
    2105117002: "За «Призраки Глубин»",
};
const dungeonsTriumphHashes = ["3718971745", "3191784400", "3205009787", "3950599483", "4126703847", "4032136335", "2105117002"];
export { dungeonsTriumphHashes, roleRequirements };
//# sourceMappingURL=roleRequirements.js.map