export const roleRequirements = {
    284821378: "За сбор всех мотыльков Сияющего Улья в мире-Престоле",
    2202038969: "За нахождение всех кроликов на Луне",
    3718971745: "За полное прохождение подземелья «Тиски алчности» в одиночку без смертей",
    3191784400: "За полное прохождение подземелья «Откровение» в одиночку без смертей",
    3205009787: "За полное прохождение подземелья «Расколотый трон» в одиночку без смертей",
    3950599483: "За полное прохождение подземелья «Яма ереси» в одиночку без смертей",
    4126703847: "За полное прохождение подземелья «Дуальность» в одиночку без смертей",
    4032136335: "За полное прохождение подземелья «Шпиль хранителя» в одиночку без смертей",
};
export const dungeonsTriumphHashes = [3718971745, 3191784400, 3205009787, 3950599483, 4126703847, 4032136335];
