import { SurveyAvaliableRoles } from "../interfaces/SurveyAvaliableRoles.js";
export const surveyQuestions = [
    {
        name: "[*] Играете ли вы в Destiny 2?",
        description: "",
        answers: [
            { name: "Да", value: "recommended" },
            { name: "Нет, но планирую с выходом DLC", value: "recommended" },
            { name: "Нет и не планирую", value: "serious" },
        ],
    },
    {
        name: "[*] Известен ли вам клан Night 9 и одноименный сервер?",
        description: "",
        answers: [
            { name: "Да, сервер и клан известны", value: "recommended" },
            { name: "Нет, клан или сервер неизвестны", value: "serious" },
        ],
    },
    {
        name: "[*] Интересуетесь ли вы жизнью и развитием клана Night 9?",
        description: "",
        answers: [
            { name: "Да, порой захожу на сервер посмотреть что да как", value: "recommended" },
            { name: "Нет, этот клан меня не интересует", value: "serious" },
        ],
    },
    {
        name: "[*] Что бы вы предпочли: большой состав клана, но многие из него неактивны или малый состав, но только с активными?",
        description: "Немного доп. информации: кланы в Destiny 2 ограничены 100 участниками - до этого лимита нет никаких ограничений из-за количества состава",
        answers: ["Большой состав", "Малый состав"],
        avaliableTo: [SurveyAvaliableRoles.clanMember],
    },
    {
        name: "[*] С кем вы предпочитаете играть?",
        description: "В этом вопросе ставится задача узнать с кем вы играете - будь то вы предпочитаете игру без поиска группы вне игры или предпочитаете собираться с другими людьми перед прохождением активностей\nВ этом вопросе к сбору группы приравнивается и вступление в какие-либо.\n\n1. Я собираю группу из участников клана Night 9 И из игроков с LFG-серверов/приложений\n2. Я собираю группу ТОЛЬКО из участников клана Night 9\n3. Я собираю группу ТОЛЬКО из игроков с LFG-серверов/приложений\n4. Я играю только в одиночку и ограничиваюсь подбором в игре",
        answers: [
            { name: "1 ответ", value: "recommended" },
            { name: "2 ответ", value: "recommended" },
            { name: "3 ответ", value: "recommended" },
            { name: "4 ответ", value: "serious" },
        ],
        avaliableTo: [SurveyAvaliableRoles.clanMember],
    },
    {
        name: "[*] Играете ли вы с участниками клана?",
        description: "При ответе на этот вопрос нам будет известна ваша статистика в голосовых и текстовых каналах\nПожалуйста, обратите внимание на вопрос - учитываются _ТОЛЬКО_ участники клана\n\n1. Я играю как с знакомыми участниками клана, так и с теми, кто хочет присоединится ко мне\n2. Я играю только с уже знакомыми участниками клана\n3. Я играю только с игроками вне клана",
        answers: ["1 ответ", "2 ответ", "3 ответ"],
        avaliableTo: [SurveyAvaliableRoles.clanMember],
    },
    {
        name: "[!] Пользуетесь ли вы каналом #💎｜основной-чат?",
        description: `В <#677562878391353344> часто ведется обсуждение различных механик игры, нововедений, изменений в балансе и многом другом. В канале можно свободно задавать вопросы, обсуждать другие игры и любые темы.\n\n1. Часто общаюсь в этом канале\n2. Иногда читаю или общаюсь в канале\n3. Редко только читаю сообщения\n4. Не пользуюсь/очень давно пользовался этим каналом`,
        answers: [{ name: "1 ответ" }, { name: "2 ответ" }, { name: "3 ответ", value: "modal" }, { name: "4 ответ", value: "modal" }],
    },
    {
        name: "[!] Читаете ли вы новости в канале 📣｜news?",
        description: `В <#677562175790907403> автоматически публикуются официальные новости с Bungie.net и твиттер-аккаунтов разработчиков, а также информацию по дестини, включающую: еженедельное обновление, информацию по Зуру, информацию по Осирису.\n\n1. Часто читаю новости в этом канале\n2. Иногда захожу в канал\n3. Не пользуюсь/очень давно пользовался этим каналом\n4. Не знаю английский, а поэтому не пользуюсь каналом`,
        answers: [{ name: "1 ответ" }, { name: "2 ответ" }, { name: "3 ответ", value: "modal" }, { name: "4 ответ", value: "modal" }],
    },
    {
        name: "[!] Читаете ли вы новости в канале 📢｜новости?",
        description: `В <#690969928353710148> публикуются изменения сервера, бота и важные новости по игре.\n\n1. Часто читаю сообщения в этом канале\n2. Иногда захожу в канал\n3. Не пользуюсь/очень давно пользовался этим каналом`,
        answers: [{ name: "1 ответ" }, { name: "2 ответ" }, { name: "3 ответ", value: "modal" }],
    },
    {
        name: "[!] Оформление и доступность канала 🌟｜роли",
        description: `В <#1041489424048979968> находится информация по всем/по большинству ролей на сервере.\nВ канале подробно описаны все требования для каждой из ролей. По категориям. В списке категорий.\nПомимо этого, вы можете отключить или включить ту или иную категорию ролей\n\n1. Канал оформлен хорошо, требования к ролям понятны\n2. Канал оформлен не самым лучшим образом, но требования понятны\n3. Канал оформлен хорошо, но требования не самым лучшим образом\n4. Канал и требования оставляют желать лучшего`,
        answers: [
            { name: "1 ответ" },
            { name: "2 ответ", value: "modal" },
            { name: "3 ответ", value: "modal" },
            { name: "4 ответ", value: "modal" },
        ],
    },
    {
        name: "[!] Какие объемы информации вы предпочитаете?",
        description: `На сервере, в основном, публикуются длинные посты, длинные описания, длинные новости и другие объемные тексты.\nВ длинных текстах легко описывать любые команды и любую информацию, которую необходимо донести до читателя.\n\nКак вы относитесь к подобному? Если вы ранее не читали длинную информацию, то будете ли вы читать более сжатую?`,
        answers: [
            { name: "Оставить всё как есть" },
            { name: "Использовать лишь краткие тексты" },
            { name: "Своё предложение", value: "modal" },
        ],
    },
    {
        name: "[/] Опрос насчёт команд сервера: англоязычные описания",
        description: "На сервере мы предоставляем описания для слеш-команд на английском языке. В данный момент все команды (за исключением одной) имеют полное англоязычное описание.\nИмеет ли для вас это какое-то значение?",
        answers: ["У меня не английский дискорд", "Лучше русские описания", "Меня всё устраивает"],
    },
    {
        name: "[/] Опрос насчёт команд сервера: /информация",
        description: "Команда позволяет вам получить информацию об любом зарегистрированном участнике сервера включая: клан пользователя, ссылки на все ресурсы по Destiny 2 (включая персонажей), краткую информацию по всем персонажам (уровень силы, общее время игры, последний актив на нём), статистику актива на сервере, информацию об доступных заданиях на сверхмощное снаряжение для каждого из персонажей, прогресс рангов всех торговцев из игры\n\nСитуации, в которой может пригодится такая информация:\n - Во время общения зашла речь о статистике в: рейдах, подземельях, ПВП, налетах, пр., но нет прямой ссылки на статистику собеседника\n - Вы захотели узнать доступные предметы в коллекции [игрока] на его титане (находите ссылку на Braytech с иконкой <:titan:995496472722284596>)\n - Начало сезона. Прокачка уровня силы. Вы захотели узнать оставшиеся для вас задания с сверхмощным снаряжением",
        answers: ["Полезная команда, пользуюсь", "Впервые узнал об этой команде", "Не вижу ситуаций для нужды в такой информации"],
    },
    {
        name: "[/] Опрос насчёт команд сервера: /закрытия",
        description: "Команда позволяет вам получить статистику об всех попытках закрыть как рейды, так и любые другие активности в игре. Статистика включает:\n - Количество всех закрытых рейдов, количество отдельно взятых закрытых рейдов, а также все попытки (т.е. включая неудачные)\n - Статистику по убийствам и смертям в отдельно взятом рейде\n - Статистику по проведенному времени в каждом из рейдов\n - Статистику по первым/последним, по самым быстрым/долгим, включая попытки, а также успешные завершения каждого из рейдов\n\nСитуации, в которой может пригодится такая информация:\n - Вы захотели проверить самое долгое закрытие игрока\n - Вы захотели проверить самое первое закрытие игрока\n - Вы захотели проверить что-то помимо рейдов\n - Вы захотели посмотреть полный список пройденных заданий на аккаунте",
        answers: ["Полезная команда, пользуюсь", "Впервые узнал об этой команде", "Не вижу ситуаций для нужды в такой информации"],
    },
    {
        name: "[/] Опрос насчёт команд сервера: /рейд создать",
        description: "Команда позволяет вам создать набор на любой доступный рейд в игре\nКак вы считаете, понятна ли эта команда сама по себе (т.е. по названию и названию параметров), с учетом инструкций в соответствующем канале, а также из описания команды?\n\n1. Команда не требует разъяснений - всё понятно из названия самой команды и её параметров\n2. Команда понятна, но некоторые параметры сложны в интуитивном понимании из-за чего приходится читать инструкцию или описание команды\n3. Команда непонятна и без инструкции в ней не разобраться\n4. Команда непонятна, а все инструкции никак не помогают",
        answers: [
            { name: "1 вариант" },
            { name: "2 вариант", value: "modal" },
            { name: "3 вариант", value: "modal" },
            { name: "4 вариант", value: "modal" },
        ],
    },
    {
        name: "[/] Опрос насчёт команд сервера: /рейд изменить",
        description: "Команда позволяет вам изменить созданный вами набор на рейд\nКак вы считаете, понятна ли эта команда сама по себе (т.е. по названию и названию параметров), с учетом инструкций в соответствующем канале, а также из описания команды?\n\n1. Команда не требует разъяснений - всё понятно из названия самой команды и её параметров\n2. Команда понятна, но некоторые параметры сложны в интуитивном понимании из-за чего приходится читать инструкцию или описание команды\n3. Команда непонятна и без инструкции в ней не разобраться\n4. Команда непонятна, а все инструкции никак не помогают",
        answers: [
            { name: "1 вариант" },
            { name: "2 вариант", value: "modal" },
            { name: "3 вариант", value: "modal" },
            { name: "4 вариант", value: "modal" },
        ],
    },
    {
        name: "[/] Опрос насчёт команд сервера: /timezone",
        description: "Команда позволяет вам указать свой часовой пояс на сервере.\n\nКак вы считаете, понятна и удобна ли эта команда сама по себе (из названия), с учетом описания команды?\n\n**Понятна** - вы имеете представление об том, что делает и на что способна команда\n**Удобна** - у вас не возникает трудностей при работе с командой\n\n1. Команда понятна и удобна\n2. Команда понятна, но неудобна\n3. Команда непонятна, но удобна\n4. Команда непонятна и неудобна",
        answers: [
            { name: "1 вариант" },
            { name: "2 вариант", value: "modal" },
            { name: "3 вариант", value: "modal" },
            { name: "4 вариант", value: "modal" },
        ],
    },
    {
        name: "[volve] Как бы вам хотелось видеть 'меня' в тексте",
        description: "Обращаясь через текст бота к вам (я буду и далее обращаться на 'Вы' (или 'вы')), я часто использую 'мы', 'рекомендуЕМ', 'просИМ' и т.д.\nСтоит ли мне так и дальше продолжать или лучше использовать 'я' в подобных случаях?\n\nПримеры:\nNight 9, сейчас: - Мы рекомендуем пройти этот опрос честно.\nNight 9, но с 'я': - Рекомендую пройти этот опрос честно",
        answers: [{ name: "Оставляем МЫ" }, { name: "Используем Я" }, { name: "Используй как считаешь нужным" }],
    },
    {
        name: "[volve] Есть ли у вас какие предложения на роль лидера клана?",
        description: "",
        answers: [{ name: "Вольве" }, { name: "Кто угодно, но не вольве" }, { name: "Я/Любой другой", value: "modal" }],
    },
];
